bbx.org
#+TITLE: Bibliography Style for JACoW
#+AUTHOR: Zhichu Chen

#+STARTUP: show3levels

#+EXPORT_FILE_NAME: index

#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.7.1/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/bootstrap/5.3.2/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/src/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/js/readtheorg.js"></script>

* Configure

** bbx
:PROPERTIES:
:header-args: :noweb tangle :tangle texmf/tex/latex/biblatex-jacow/jacow.bbx :mkdirp yes
:END:

#+begin_src latex3
  %% <<copy-right>>

  \ProvidesExplFile %«
    {jacow.bbx}
    {2024/03/21}
    {0.01}
    {JACoW biblatex bibliography style} %»

  \RequireBibliographyStyle{numeric-comp}

  <<ident>>

  <<init>>

  <<dm-fld>>

  <<dm-entry>>

  <<drv>>

  \DeclareSourcemap %«
    {
      \maps[datatype=bibtex] %«
        {
          <<drv-sourcemap>>
        } %»
    } %»

  <<fld>>

  <<mac>>

  \endinput
#+end_src


** cbx
:PROPERTIES:
:header-args: :noweb tangle :tangle texmf/tex/latex/biblatex-jacow/jacow.cbx :mkdirp yes
:END:

#+begin_src latex3
  %% <<copy-right>>

  \ProvidesExplFile %«
    {jacow.cbx}
    {2024/03/21}
    {0.01}
    {JACoW biblatex citation style} %»

  \RequireCitationStyle{numeric-comp}
#+end_src

** lbx
:PROPERTIES:
:header-args: :noweb tangle :tangle texmf/tex/latex/biblatex-jacow/jacow.lbx :mkdirp yes
:END:


#+begin_src latex3
  %% <<copy-right>>

  \ProvidesExplFile %«
    {jacow.lbx}
    {2024/03/21}
    {0.01}
    {JACoW biblatex localisation style} %»

  \InheritBibliographyExtras{english}

  \DeclareBibliographyExtras %«
    {
      <<decl-bibextra>>
    } %»

  <<new-bibstring>>

  \DefineBibliographyStrings{english} %«
    {
      <<def-bibstring>>
    } %»

  \DeclareBibliographyStrings %«
    {
      inherit      = {english},
      <<decl-bibstring>>
      september    = {{September}{Sep\adddot}},
    } %»

  \endinput
#+end_src


* JACoW biblatex style

** Do not use US punctuation
:PROPERTIES:
:header-args: :noweb-ref decl-bibextra
:END:

#+begin_src latex3
  \stdpunctuation
#+end_src

