index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-31 Sun 18:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bibliography Style for JACoW</title>
<meta name="author" content="Zhichu Chen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bibliography Style for JACoW</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4d195cd">1. Configure</a>
<ul>
<li><a href="#org6af5488">1.1. bbx</a></li>
<li><a href="#orga875463">1.2. cbx</a></li>
<li><a href="#org538e1aa">1.3. lbx</a></li>
</ul>
</li>
<li><a href="#org05639bf">2. JACoW biblatex style</a>
<ul>
<li><a href="#org35f5fa4">2.1. Do not use US punctuation</a></li>
<li><a href="#org97fc593">2.2. Redefine how to print date</a></li>
<li><a href="#orgd96ea8b">2.3. Place doi</a></li>
<li><a href="#orga4cbdbe">2.4. Print first defined field</a></li>
<li><a href="#orga64180a">2.5. Copyright©</a></li>
<li><a href="#org3efdd30">2.6. Identification</a></li>
<li><a href="#org4aebc73">2.7. Initialisation</a></li>
<li><a href="#org6a003b5">2.8. Drivers</a>
<ul>
<li><a href="#orgc3fa7be">2.8.1. inproceedings</a></li>
<li><a href="#orgc505106">2.8.2. unpublished</a></li>
<li><a href="#org534ec71">2.8.3. article</a></li>
<li><a href="#org1c42162">2.8.4. inbook</a></li>
<li><a href="#org39970f3">2.8.5. book</a></li>
<li><a href="#orgcebd94b">2.8.6. report</a></li>
<li><a href="#orgf980cdf">2.8.7. thesis</a></li>
<li><a href="#orgd60c175">2.8.8. <span class="todo TODO">TODO</span> manual</a></li>
<li><a href="#orgce377f3">2.8.9. patent</a></li>
</ul>
</li>
<li><a href="#org0b8db8a">2.9. Fields</a>
<ul>
<li><a href="#org31a9cab">2.9.1. <i>et al.</i></a></li>
<li><a href="#orged151b3">2.9.2. [title]</a></li>
<li><a href="#org461f033">2.9.3. [maintitle]/[booktitle]</a></li>
<li><a href="#org8c0fa95">2.9.4. paper [eid]</a></li>
<li><a href="#org38f82c3">2.9.5. [doi]</a></li>
<li><a href="#org5339edb">2.9.6. [url]</a></li>
</ul>
</li>
<li><a href="#orgc6fe52c">2.10. Macros</a></li>
</ul>
</li>
<li><a href="#orga40200a">3. Samples</a>
<ul>
<li><a href="#org625fe00">3.1. Conference</a>
<ul>
<li><a href="#org1c0f5ad">3.1.1. Published in previous proceedings</a></li>
<li><a href="#orgf037d0b">3.1.2. Presented as a poster or slides only</a></li>
<li><a href="#org6d4e0ba">3.1.3. Presented at this conference</a></li>
</ul>
</li>
<li><a href="#org0ce31c8">3.2. Journal</a>
<ul>
<li><a href="#orgd7a6921">3.2.1. Published article</a></li>
<li><a href="#org694dd37">3.2.2. Article accepted by a periodical</a></li>
<li><a href="#orgbc76229">3.2.3. Article submitted to a periodical</a></li>
<li><a href="#org39a90b2">3.2.4. Article not even submitted</a></li>
</ul>
</li>
<li><a href="#orgabd953c">3.3. Book</a>
<ul>
<li><a href="#org30685ce">3.3.1. Chapter in book</a></li>
<li><a href="#org371cbca">3.3.2. A complete book</a></li>
</ul>
</li>
<li><a href="#orgcf1bcb4">3.4. Report</a></li>
<li><a href="#org30e54b2">3.5. Thesis</a>
<ul>
<li><a href="#orga247b4a">3.5.1. PhD thesis</a></li>
</ul>
</li>
<li><a href="#orgabeacf5">3.6. Manual</a></li>
<li><a href="#orgb34e0a3">3.7. Private communication</a></li>
<li><a href="#org7cd74a8">3.8. Patent</a></li>
</ul>
</li>
<li><a href="#org0be0a80">4. Reference</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4d195cd" class="outline-2">
<h2 id="org4d195cd"><span class="section-number-2">1.</span> Configure</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6af5488" class="outline-3">
<h3 id="org6af5488"><span class="section-number-3">1.1.</span> bbx</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">&lt;&lt;copy-right&gt;&gt;</span>

<span style="color: #721045;">\ProvidesExplFile</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {jacow.bbx}
  {2024/03/21}
  {0.01}
  {JACoW biblatex bibliography style} <span style="color: #7f0000; font-style: italic;">%&#187;</span>

<span style="color: #721045;">\RequireBibliographyStyle</span>{numeric-comp}

&lt;&lt;ident&gt;&gt;

&lt;&lt;init&gt;&gt;

&lt;&lt;dm-fld&gt;&gt;

&lt;&lt;dm-entry&gt;&gt;

&lt;&lt;drv&gt;&gt;

<span style="color: #721045;">\DeclareSourcemap</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\maps</span>[datatype=bibtex] <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      {
        &lt;&lt;drv-sourcemap&gt;&gt;
      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

&lt;&lt;fld&gt;&gt;

&lt;&lt;mac&gt;&gt;

<span style="color: #005e8b;">\endinput</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orga875463" class="outline-3">
<h3 id="orga875463"><span class="section-number-3">1.2.</span> cbx</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">&lt;&lt;copy-right&gt;&gt;</span>

<span style="color: #721045;">\ProvidesExplFile</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {jacow.cbx}
  {2024/03/21}
  {0.01}
  {JACoW biblatex citation style} <span style="color: #7f0000; font-style: italic;">%&#187;</span>

<span style="color: #721045;">\RequireCitationStyle</span>{numeric-comp}
</pre>
</div>
</div>
</div>

<div id="outline-container-org538e1aa" class="outline-3">
<h3 id="org538e1aa"><span class="section-number-3">1.3.</span> lbx</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">&lt;&lt;copy-right&gt;&gt;</span>

<span style="color: #721045;">\ProvidesExplFile</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {jacow.lbx}
  {2024/03/21}
  {0.01}
  {JACoW biblatex localisation style} <span style="color: #7f0000; font-style: italic;">%&#187;</span>

<span style="color: #721045;">\InheritBibliographyExtras</span>{english}

<span style="color: #721045;">\DeclareBibliographyExtras</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    &lt;&lt;decl-bibextra&gt;&gt;
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

&lt;&lt;new-bibstring&gt;&gt;

<span style="color: #721045;">\DefineBibliographyStrings</span>{english} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    &lt;&lt;def-bibstring&gt;&gt;
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

<span style="color: #721045;">\DeclareBibliographyStrings</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    inherit      = {english},
    &lt;&lt;decl-bibstring&gt;&gt;
    september    = {{September}{Sep<span style="color: #721045;">\adddot</span>}},
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

<span style="color: #005e8b;">\endinput</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org05639bf" class="outline-2">
<h2 id="org05639bf"><span class="section-number-2">2.</span> JACoW biblatex style</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org35f5fa4" class="outline-3">
<h3 id="org35f5fa4"><span class="section-number-3">2.1.</span> Do not use US punctuation</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #005e8b;">\stdpunctuation</span>
</pre>
</div>
</div>
</div>
