bbx.org
** Redefine how to print date
:PROPERTIES:
:header-args: :noweb-ref decl-bibextra
:END:

#+begin_src latex3
  \newrobustcmd*{\mkdaterangejacow}[1] %«
    {
      \iffieldundef{#1year}
        %%%% year not defined
        {
          \iffieldundef{#1endyear}
            %%% endyear not defined
            {}
            %%% endyear defined, let's pretend year==endyear
            {
              \iffieldundef{#1month}
                %% month not defined
                {
                  \iffieldundef{#1endmonth}
                    % endmonth not defined
                    {\printfield{#1endyear}}
                    % endmonth defined, let's pretend month==endmonth
                    {\mkbibmonth{\thefield{#1endmonth}}\space\printfield{#1endyear}} %»
                }
                %% month defined
                {
                  \iffieldundef{#1endmonth}
                    % endmonth not defined, let's pretend month==endmonth
                    {\mkbibmonth{\thefield{#1month}}\space\printfield{#1endyear}}
                    % endmonth defined
                    {
                      \iffieldsequal{#1month}{#1endmonth}
                        {\mkbibmonth{\thefield{#1month}}\space\printfield{#1endyear}}
                        {\mkbibmonth{\thefield{#1month}}--\mkbibmonth{\thefield{#1endmonth}}\space\printfield{#1endyear}} %»
                    } %»
                } %»
            } %»
        }
        %%%% year defined
        {
          \iffieldundef{#1endyear}
            %%% endyear not defined, let's pretend year==endyear
            {
              \iffieldundef{#1month}
                %% month not defined
                {
                  \iffieldundef{#1endmonth}
                    % endmonth not defined
                    {\printfield{#1year}}
                    % endmonth defined, let's pretend month==endmonth
                    {\mkbibmonth{\thefield{#1endmonth}}\space\printfield{#1year}} %»
                }
                %% month defined
                {
                  \iffieldundef{#1endmonth}
                    % endmonth not defined, let's pretend month==endmonth
                    {\mkbibmonth{\thefield{#1month}}\space\printfield{#1year}}
                    % endmonth defined
                    {
                      \iffieldsequal{#1month}{#1endmonth}
                        {\mkbibmonth{\thefield{#1month}}\space\printfield{#1year}}
                        {\mkbibmonth{\thefield{#1month}}--\mkbibmonth{\thefield{#1endmonth}}\space\printfield{#1year}} %»
                    } %»
                } %»
            }
            %%% endyear defined
            {
              \iffieldsequal{#1year}{#1endyear}
                {
                  \iffieldundef{#1month}
                    %% month not defined
                    {
                      \iffieldundef{#1endmonth}
                        % endmonth not defined
                        {\printfield{#1year}}
                        % endmonth defined, let's pretend month==endmonth
                        {\mkbibmonth{\thefield{#1endmonth}}\space\printfield{#1year}} %»
                    }
                    %% month defined
                    {
                      \iffieldundef{#1endmonth}
                        % endmonth not defined, let's pretend month==endmonth
                        {\mkbibmonth{\thefield{#1month}}\space\printfield{#1year}}
                        % endmonth defined
                        {
                          \iffieldsequal{#1month}{#1endmonth}
                            {\mkbibmonth{\thefield{#1month}}\space\printfield{#1year}}
                            {\mkbibmonth{\thefield{#1month}}--\mkbibmonth{\thefield{#1endmonth}}\space\printfield{#1year}} %»
                        } %»
                    } %»
                }
                {
                  \iffieldundef{#1month}
                    %% month not defined
                    {
                      \printfield{#1year}--\printfield{#1endyear}
                    }
                    %% month defined
                    {
                      \iffieldundef{#1endmonth}
                        % endmonth not defined
                        {
                          \printfield{#1year}--\printfield{#1endyear}
                        }
                        % endmonth defined
                        {
                          \mkbibmonth{\thefield{#1month}}\space\printfield{#1year}--\mkbibmonth{\thefield{#1endmonth}}\space\printfield{#1endyear}
                        } %»
                    } %»
                } %»
            } %»
        } %»
    }
#+end_src

#+begin_src latex3
  \protected\csedef{blx@imc@printdate}     {\noexpand\csuse{mkdaterangejacow}{}}
  \protected\csedef{blx@imc@printeventdate}{\noexpand\csuse{mkdaterangejacow}{event}}
#+end_src

