index.html

<div id="outline-container-org97fc593" class="outline-3">
<h3 id="org97fc593"><span class="section-number-3">2.2.</span> Redefine how to print date</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\newrobustcmd</span>*{<span style="color: #721045;">\mkdaterangejacow</span>}[1] <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\iffieldundef</span>{#1year}
      <span style="color: #7f0000; font-style: italic;">%%%% </span><span style="color: #7f0000; font-style: italic;">year not defined</span>
      {
        <span style="color: #721045;">\iffieldundef</span>{#1endyear}
          <span style="color: #7f0000; font-style: italic;">%%% </span><span style="color: #7f0000; font-style: italic;">endyear not defined</span>
          {}
          <span style="color: #7f0000; font-style: italic;">%%% </span><span style="color: #7f0000; font-style: italic;">endyear defined, let's pretend year==endyear</span>
          {
            <span style="color: #721045;">\iffieldundef</span>{#1month}
              <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month not defined</span>
              {
                <span style="color: #721045;">\iffieldundef</span>{#1endmonth}
                  <span style="color: #7f0000; font-style: italic;">% endmonth not defined</span>
                  {<span style="color: #721045;">\printfield</span>{#1endyear}}
                  <span style="color: #7f0000; font-style: italic;">% endmonth defined, let's pretend month==endmonth</span>
                  {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1endmonth}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1endyear}} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
              }
              <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month defined</span>
              {
                <span style="color: #721045;">\iffieldundef</span>{#1endmonth}
                  <span style="color: #7f0000; font-style: italic;">% endmonth not defined, let's pretend month==endmonth</span>
                  {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1endyear}}
                  <span style="color: #7f0000; font-style: italic;">% endmonth defined</span>
                  {
                    <span style="color: #721045;">\iffieldsequal</span>{#1month}{#1endmonth}
                      {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1endyear}}
                      {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}--<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1endmonth}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1endyear}} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
                  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
              } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
          } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
      }
      <span style="color: #7f0000; font-style: italic;">%%%% </span><span style="color: #7f0000; font-style: italic;">year defined</span>
      {
        <span style="color: #721045;">\iffieldundef</span>{#1endyear}
          <span style="color: #7f0000; font-style: italic;">%%% </span><span style="color: #7f0000; font-style: italic;">endyear not defined, let's pretend year==endyear</span>
          {
            <span style="color: #721045;">\iffieldundef</span>{#1month}
              <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month not defined</span>
              {
                <span style="color: #721045;">\iffieldundef</span>{#1endmonth}
                  <span style="color: #7f0000; font-style: italic;">% endmonth not defined</span>
                  {<span style="color: #721045;">\printfield</span>{#1year}}
                  <span style="color: #7f0000; font-style: italic;">% endmonth defined, let's pretend month==endmonth</span>
                  {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1endmonth}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
              }
              <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month defined</span>
              {
                <span style="color: #721045;">\iffieldundef</span>{#1endmonth}
                  <span style="color: #7f0000; font-style: italic;">% endmonth not defined, let's pretend month==endmonth</span>
                  {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}}
                  <span style="color: #7f0000; font-style: italic;">% endmonth defined</span>
                  {
                    <span style="color: #721045;">\iffieldsequal</span>{#1month}{#1endmonth}
                      {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}}
                      {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}--<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1endmonth}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
                  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
              } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
          }
          <span style="color: #7f0000; font-style: italic;">%%% </span><span style="color: #7f0000; font-style: italic;">endyear defined</span>
          {
            <span style="color: #721045;">\iffieldsequal</span>{#1year}{#1endyear}
              {
                <span style="color: #721045;">\iffieldundef</span>{#1month}
                  <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month not defined</span>
                  {
                    <span style="color: #721045;">\iffieldundef</span>{#1endmonth}
                      <span style="color: #7f0000; font-style: italic;">% endmonth not defined</span>
                      {<span style="color: #721045;">\printfield</span>{#1year}}
                      <span style="color: #7f0000; font-style: italic;">% endmonth defined, let's pretend month==endmonth</span>
                      {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1endmonth}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
                  }
                  <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month defined</span>
                  {
                    <span style="color: #721045;">\iffieldundef</span>{#1endmonth}
                      <span style="color: #7f0000; font-style: italic;">% endmonth not defined, let's pretend month==endmonth</span>
                      {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}}
                      <span style="color: #7f0000; font-style: italic;">% endmonth defined</span>
                      {
                        <span style="color: #721045;">\iffieldsequal</span>{#1month}{#1endmonth}
                          {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}}
                          {<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}--<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1endmonth}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
                      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
                  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
              }
              {
                <span style="color: #721045;">\iffieldundef</span>{#1month}
                  <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month not defined</span>
                  {
                    <span style="color: #721045;">\printfield</span>{#1year}--<span style="color: #721045;">\printfield</span>{#1endyear}
                  }
                  <span style="color: #7f0000; font-style: italic;">%% </span><span style="color: #7f0000; font-style: italic;">month defined</span>
                  {
                    <span style="color: #721045;">\iffieldundef</span>{#1endmonth}
                      <span style="color: #7f0000; font-style: italic;">% endmonth not defined</span>
                      {
                        <span style="color: #721045;">\printfield</span>{#1year}--<span style="color: #721045;">\printfield</span>{#1endyear}
                      }
                      <span style="color: #7f0000; font-style: italic;">% endmonth defined</span>
                      {
                        <span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1month}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1year}--<span style="color: #721045;">\mkbibmonth</span>{<span style="color: #721045;">\thefield</span>{#1endmonth}}<span style="color: #721045;">\space</span><span style="color: #005e8b;">\printfield</span>{#1endyear}
                      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
                  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
              } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
          } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\protected</span><span style="color: #005e8b;">\csedef</span>{blx@imc@printdate}     {<span style="color: #721045;">\noexpand</span><span style="color: #005e8b;">\csuse</span>{mkdaterangejacow}{}}
<span style="color: #721045;">\protected</span><span style="color: #005e8b;">\csedef</span>{blx@imc@printeventdate}{<span style="color: #721045;">\noexpand</span><span style="color: #005e8b;">\csuse</span>{mkdaterangejacow}{event}}
</pre>
</div>
</div>
</div>
