index.html

<div id="outline-container-orgd96ea8b" class="outline-3">
<h3 id="orgd96ea8b"><span class="section-number-3">2.3.</span> Place doi</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\cs_new:Npn</span> <span style="color: #005e8b;">\put_doi:n</span> #1
{
  <span style="color: #721045;">\ifvmode</span>
    <span style="color: #721045;">\leavevmode</span>
  <span style="color: #721045;">\fi</span>
  <span style="color: #721045;">\unskip</span>
  <span style="color: #721045;">\ifhmode</span>
    <span style="color: #721045;">\predisplaypenalty</span>     10000<span style="color: #721045;">\relax</span>
    <span style="color: #721045;">\postdisplaypenalty</span>    10000<span style="color: #721045;">\relax</span>
    <span style="color: #721045;">\abovedisplayskip</span>      -<span style="color: #721045;">\baselineskip</span>
    <span style="color: #721045;">\belowdisplayskip</span>      -<span style="color: #721045;">\baselineskip</span>
    <span style="color: #721045;">\abovedisplayshortskip</span> <span style="color: #721045;">\abovedisplayskip</span>
    <span style="color: #721045;">\belowdisplayshortskip</span> <span style="color: #721045;">\belowdisplayskip</span>
    <span style="color: #3548cf;">$$</span>
    <span style="color: #721045;">\global</span> <span style="color: #721045;">\dimen</span>0=<span style="color: #721045;">\dimexpr</span> <span style="color: #721045;">\predisplaysize</span> -2em <span style="color: #721045;">\relax</span>
    <span style="color: #3548cf;">$$</span>
    <span style="color: #721045;">\count</span>0 <span style="color: #721045;">\prevgraf</span>
    <span style="color: #721045;">\advance</span>  <span style="color: #721045;">\count</span>0 by -3
    <span style="color: #721045;">\advance</span>  <span style="color: #721045;">\count</span>0 by -1
    <span style="color: #721045;">\prevgraf</span> <span style="color: #721045;">\count</span>0
  <span style="color: #721045;">\fi</span>
  <span style="color: #721045;">\noindent</span> <span style="color: #721045;">\kern</span> <span style="color: #721045;">\dimexpr</span> <span style="color: #721045;">\dimen</span>0 - <span style="color: #721045;">\@totalleftmargin</span> <span style="color: #721045;">\relax</span>
  <span style="color: #721045;">\setbox</span>0=<span style="color: #721045;">\hbox</span>{<span style="color: #721045;">\space</span>#1}<span style="color: #7f0000; font-style: italic;">%</span>
  <span style="color: #721045;">\ifdim</span> <span style="color: #721045;">\dimexpr</span> <span style="color: #721045;">\hsize</span>-<span style="color: #721045;">\dimen</span>0 <span style="color: #721045;">\relax</span> &lt; <span style="color: #721045;">\wd</span>0
    <span style="color: #721045;">\newline</span>
  <span style="color: #721045;">\else</span>
    <span style="color: #721045;">\space</span>
  <span style="color: #721045;">\fi</span>
  {#1}
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\tl_new:N</span> <span style="color: #005e8b;">\l_doi_tl</span>
<span style="color: #005e8b;">\str_new:N</span> <span style="color: #005e8b;">\l_doi:_str</span>
<span style="color: #005e8b;">\str_new:N</span> <span style="color: #005e8b;">\l_doi_str</span>
<span style="color: #005e8b;">\str_new:N</span> <span style="color: #005e8b;">\l_prefix_str</span>
<span style="color: #005e8b;">\str_new:N</span> <span style="color: #005e8b;">\l_vol_str</span>
<span style="color: #005e8b;">\str_gset:Nn</span> <span style="color: #005e8b;">\l_doi:_str</span> { doi: }
<span style="color: #721045;">\DeclareDocumentCommand</span>{<span style="color: #721045;">\doi</span>}{sd&lt;&gt;om}
{
  <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> { #4 }
  <span style="color: #721045;">\IfBooleanTF</span> {#1}
  {
    <span style="color: #721045;">\IfValueTF</span>{#2}
    {
      <span style="color: #005e8b;">\str_case_e:nn</span> { <span style="color: #005e8b;">\str_foldcase:n</span> { #2 } }
      {
        { jacow } { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> {doi&lt;jacow&gt;[event&amp;year]{paper}} }
        { arxiv } { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> {doi&lt;arxiv&gt;[2-digit-year&amp;month]{paper}} }
        { prl }   { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> {doi&lt;prl&gt;[vol]{page} ~ where ~ the ~ first ~ two ~ digits ~ of ~ &#8220;page&#8221; ~ is ~ issue ~ number} }
        { prab }  { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> {doi&lt;prab&gt;[vol]{page} ~ where ~ the ~ first ~ two ~ digits ~ of ~ &#8220;page&#8221; ~ is ~ issue ~ number} }
        { nima }  { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> {doi&lt;nima&gt;[year]{page}} }
        { ieee/access }  { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> {doi&lt;ieee/access&gt;[year]{magicnumber}} }
        { mpid/sensors } { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_doi_str</span> {doi&lt;mpid/sensors&gt;[vol&amp;no]{page}} }
      }
      <span style="color: #005e8b;">\str_concat:NNN</span> <span style="color: #005e8b;">\l_doi_str</span> <span style="color: #005e8b;">\c_backslash_str</span> <span style="color: #005e8b;">\l_doi_str</span>
    }
    {
      <span style="color: #005e8b;">\str_concat:NNN</span> <span style="color: #005e8b;">\l_doi_str</span> <span style="color: #005e8b;">\l_doi:_str</span> <span style="color: #005e8b;">\l_doi_str</span>
    }
  }
  {
    <span style="color: #005e8b;">\regex_replace_once:NnN</span> <span style="color: #005e8b;">\l_http_doi_org_regex</span> { \1 } <span style="color: #005e8b;">\l_doi_str</span>
    <span style="color: #005e8b;">\regex_replace_once:NnN</span> <span style="color: #005e8b;">\l_doi:_regex</span>         { \1 } <span style="color: #005e8b;">\l_doi_str</span>
    <span style="color: #721045;">\IfValueT</span>{#2}
    {
      <span style="color: #005e8b;">\str_case_e:nn</span> { <span style="color: #005e8b;">\str_foldcase:n</span> { #2 } }
      {
        { jacow }        { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_prefix_str</span> {10.18429/JACoW-}            <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_vol_str</span> {#3-} }
        { arxiv }        { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_prefix_str</span> {10.48550/arXiv.}            <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_vol_str</span> {#3.} }
        { prl }          { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_prefix_str</span> {10.1103/PhysRevLett.}       <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_vol_str</span> {#3.} }
        { prab }         { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_prefix_str</span> {10.1103/PhysRevAccelBeams.} <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_vol_str</span> {#3.} }
        { nima }         { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_prefix_str</span> {10.1016/j.nima.}            <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_vol_str</span> {#3.} }
        { ieee/access }  { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_prefix_str</span> {10.1109/ACCESS.}            <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_vol_str</span> {#3.} }
        { mpid/sensors } { <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_prefix_str</span> {10.3390/s}                  <span style="color: #005e8b;">\str_set:Nn</span> <span style="color: #005e8b;">\l_vol_str</span> {#3}  }
      }
      <span style="color: #721045;">\IfValueT</span>{#3}
      {
        <span style="color: #005e8b;">\str_concat:NNN</span> <span style="color: #005e8b;">\l_prefix_str</span> <span style="color: #005e8b;">\l_prefix_str</span> <span style="color: #005e8b;">\l_vol_str</span>
      }
      <span style="color: #005e8b;">\str_concat:NNN</span> <span style="color: #005e8b;">\l_doi_str</span> <span style="color: #005e8b;">\l_prefix_str</span> <span style="color: #005e8b;">\l_doi_str</span>
    }
    <span style="color: #005e8b;">\regex_replace_once:NnN</span> <span style="color: #005e8b;">\l_doi:jacow_regex</span>         { \1 JACoW <span style="color: #721045;">\c</span>{str_uppercase:n} <span style="color: #721045;">\cB</span>\{ \3 <span style="color: #721045;">\cE</span>\}  } <span style="color: #005e8b;">\l_doi_str</span>
    <span style="color: #005e8b;">\str_concat:NNN</span> <span style="color: #005e8b;">\l_doi_str</span> <span style="color: #005e8b;">\l_doi:_str</span> <span style="color: #005e8b;">\l_doi_str</span>
  }
  <span style="color: #005e8b;">\put_doi:n</span> { <span style="color: #721045;">\tt</span> <span style="color: #005e8b;">\l_doi_str</span> }
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #005e8b;">\regex_new:N</span> <span style="color: #005e8b;">\l_http_doi_org_regex</span>
<span style="color: #005e8b;">\regex_new:N</span> <span style="color: #005e8b;">\l_doi:_regex</span>
<span style="color: #005e8b;">\regex_new:N</span> <span style="color: #005e8b;">\l_doi:jacow_regex</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #005e8b;">\regex_set:Nn</span> <span style="color: #005e8b;">\l_http_doi_org_regex</span> { <span style="color: #721045;">\A</span> .*doi.org/(10\.) }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #005e8b;">\regex_set:Nn</span> <span style="color: #005e8b;">\l_doi:_regex</span> { .*doi:<span style="color: #721045;">\s</span>*(10\.) }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #005e8b;">\regex_set:Nn</span> <span style="color: #005e8b;">\l_doi:jacow_regex</span> { (10.18429/)((?i)jacow)(.*) }
</pre>
</div>
</div>
</div>
