bbx.org
** Print first defined field
:PROPERTIES:
:header-args: :noweb-ref decl-bibextra
:END:

#+begin_src latex3
  \NewDocumentCommand\printfirst{omo} %«
    {
      \clist_map_inline:nn {#2} %«
        {
          \iffieldundef{##1}
            {}
            {
              \IfValueT{#1}{\printtext{#1}}
              \printfield{##1}
              \IfValueT{#3}{\printtext{#3}}
              \clist_map_break:
            } %»
        } %»
    } %»
#+end_src


#+begin_src latex3
  \NewDocumentCommand\printfirstlist{omo} %«
    {
      \clist_map_inline:nn {#2} %«
        {
          \iffieldundef{##1}
            {}
            {
              \IfValueT{#1}{\printtext{#1}}
              \printlist{##1}
              \IfValueT{#3}{\printtext{#3}}
              \clist_map_break:
            } %»
        } %»
    } %»
#+end_src

** Copyright©
:PROPERTIES:
:header-args: :noweb-ref copy-right
:END:

#+begin_src latex3
  biblatex-jacow --- A biblatex implementation of the
  «
    JACoW bibliography style
  »
#+end_src

** Identification
:PROPERTIES:
:header-args: :noweb-ref ident
:END:

** Initialisation
:PROPERTIES:
:header-args: :noweb-ref init
:END:

#+begin_src latex3
  \renewcommand*\bibnamedash{\textemdash\textemdash}
  \renewcommand*\intitlepunct{\addspace}
  \renewcommand*\newunitpunct{\addcomma\addspace}
#+end_src


** Drivers
:PROPERTIES:
:header-args: :noweb-ref drv
:END:


*** inproceedings

The expected result will look like this:
- [Author], “[Paper title]”, in /[Proc. Event]/, [venue], [date], paper [eid]. p. [page]. =doi:10.[xxx/yyy/zzz]=
- [Author], “[Paper title]”, in /[Proc. Event]/, [venue], [date], paper [eid]. pp. [pages]. =doi:10.[xxx/yyy/zzz]=

#+begin_src latex3

  \DeclareBibliographyDriver{inproceedings} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \setunit{\labelnamepunct}\newblock
        \usebibmacro{title}
        \newunit
        \printfirst{maintitle,booktitle}
        \newunit\newblock
        \printfield{venue}
        \newunit
        \usebibmacro{eventdate/date/mon.year}
        \newunit\newblock
        \printfield{eid}
        \newunit
        \printfield{pages}
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»

#+end_src



**** [date]
:PROPERTIES:
:header-args: :noweb-ref mac
:END:

#+begin_src latex3 :noweb-ref mac
  \newbibmacro*{eventdate/date/mon.year} %«
    {
      \iffieldundef{eventyear}
        {
          \usebibmacro{date}%
        }
        {
          \usebibmacro{eventdate}
        }%»
    } %»
#+end_src

#+begin_src latex3
  \renewbibmacro*{date}     {\printdate}
  \newbibmacro*  {eventdate}{\printeventdate}
#+end_src

