index.html

<div id="outline-container-orga4cbdbe" class="outline-3">
<h3 id="orga4cbdbe"><span class="section-number-3">2.4.</span> Print first defined field</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\NewDocumentCommand</span><span style="color: #005e8b;">\printfirst</span>{omo} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\clist_map_inline:nn</span> {#2} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      {
        <span style="color: #721045;">\iffieldundef</span>{##1}
          {}
          {
            <span style="color: #721045;">\IfValueT</span>{#1}{<span style="color: #721045;">\printtext</span>{#1}}
            <span style="color: #721045;">\printfield</span>{##1}
            <span style="color: #721045;">\IfValueT</span>{#3}{<span style="color: #721045;">\printtext</span>{#3}}
            <span style="color: #721045;">\clist_map_break:</span>
          } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\NewDocumentCommand</span><span style="color: #005e8b;">\printfirstlist</span>{omo} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\clist_map_inline:nn</span> {#2} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      {
        <span style="color: #721045;">\iffieldundef</span>{##1}
          {}
          {
            <span style="color: #721045;">\IfValueT</span>{#1}{<span style="color: #721045;">\printtext</span>{#1}}
            <span style="color: #721045;">\printlist</span>{##1}
            <span style="color: #721045;">\IfValueT</span>{#3}{<span style="color: #721045;">\printtext</span>{#3}}
            <span style="color: #721045;">\clist_map_break:</span>
          } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga64180a" class="outline-3">
<h3 id="orga64180a"><span class="section-number-3">2.5.</span> Copyright©</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-latex3">biblatex-jacow --- A biblatex implementation of the
&#171;
  JACoW bibliography style
&#187;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3efdd30" class="outline-3">
<h3 id="org3efdd30"><span class="section-number-3">2.6.</span> Identification</h3>
<div class="outline-text-3" id="text-2-6">
</div>
</div>

<div id="outline-container-org4aebc73" class="outline-3">
<h3 id="org4aebc73"><span class="section-number-3">2.7.</span> Initialisation</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\renewcommand</span>*<span style="color: #721045;">\bibnamedash</span>{<span style="color: #721045;">\textemdash</span><span style="color: #005e8b;">\textemdash</span>}
<span style="color: #721045;">\renewcommand</span>*<span style="color: #721045;">\intitlepunct</span>{<span style="color: #721045;">\addspace</span>}
<span style="color: #721045;">\renewcommand</span>*<span style="color: #721045;">\newunitpunct</span>{<span style="color: #721045;">\addcomma</span><span style="color: #005e8b;">\addspace</span>}
</pre>
</div>
</div>
</div>


<div id="outline-container-org6a003b5" class="outline-3">
<h3 id="org6a003b5"><span class="section-number-3">2.8.</span> Drivers</h3>
<div class="outline-text-3" id="text-2-8">
</div>


<div id="outline-container-orgc3fa7be" class="outline-4">
<h4 id="orgc3fa7be"><span class="section-number-4">2.8.1.</span> inproceedings</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
The expected result will look like this:
</p>
<ul class="org-ul">
<li>[Author], “[Paper title]”, in <i>[Proc. Event]</i>, [venue], [date], paper [eid]. p. [page]. <code>doi:10.[xxx/yyy/zzz]</code></li>
<li>[Author], “[Paper title]”, in <i>[Proc. Event]</i>, [venue], [date], paper [eid]. pp. [pages]. <code>doi:10.[xxx/yyy/zzz]</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{inproceedings} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\labelnamepunct</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printfirst</span>{maintitle,booktitle}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{venue}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\usebibmacro</span>{eventdate/date/mon.year}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{eid}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printfield</span>{pages}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>



<ol class="org-ol">
<li><a id="orgef4f49b"></a>[date]<br />
<div class="outline-text-5" id="text-2-8-1-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\newbibmacro</span>*{eventdate/date/mon.year} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\iffieldundef</span>{eventyear}
      {
        <span style="color: #721045;">\usebibmacro</span>{date}<span style="color: #7f0000; font-style: italic;">%</span>
      }
      {
        <span style="color: #721045;">\usebibmacro</span>{eventdate}
      }<span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\renewbibmacro</span>*{date}     {<span style="color: #721045;">\printdate</span>}
<span style="color: #721045;">\newbibmacro</span>*  {eventdate}{<span style="color: #721045;">\printeventdate</span>}
</pre>
</div>
</div>
</li>
</ol>
</div>
