bbx.org
*** unpublished

The expected result will look like this:
- [Author], “[Paper title]”, presented at the [Event], [venue], [date], paper [eid], unpublished.
- [Author], “[Paper title]”, presented at the [Event], [venue], [date], paper [eid], this conference.
- [Author], “[Paper title]”, /[Journal]/, to be published.
- [Author], “[Paper title]”, submitted for publication.
- [Author], “[Paper title]”, unpublished.
- [Author], private communication, [date].



#+begin_src latex3

  \DeclareBibliographyDriver{unpublished} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \setunit{\labelnamepunct}\newblock
        \usebibmacro{title}
        \newunit\newblock
        \usebibmacro{event/journal}
        \newunit\newblock
        \printfield{eid}
        \newunit\newblock
        \usebibmacro{type}
        \newunit\newblock
        \usebibmacro{private+date}
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    }  %»

#+end_src

#+begin_src latex3 :noweb-ref init
  \clist_const:Nn \l_jacow_unpublished_types {atevent,atconf,thisevent,thisconf,submitted,submittedto,private}
#+end_src


#+begin_src latex3 :noweb-ref drv-sourcemap
  \map %«
    {
      \step[typesource=atevent,   typetarget=unpublished,final]
      \step[fieldset=type,        fieldvalue=atevent]
    } %»
  \map %«
    {
      \step[typesource=atconf,    typetarget=unpublished,final]
      \step[fieldset=type,        fieldvalue=atevent]
    } %»
  \map %«
    {
      \step[typesource=thisevent, typetarget=unpublished,final]
      \step[fieldset=type,        fieldvalue=thisevent]
    } %»
  \map %«
    {
      \step[typesource=thisconf,  typetarget=unpublished,final]
      \step[fieldset=type,        fieldvalue=thisevent]
    } %»
  \map %«
    {
      \step[typesource=submitted, typetarget=unpublished,final]
      \step[fieldset=type,        fieldvalue=submitted]
    } %»
  \map %«
    {
      \step[typesource=submittedto, typetarget=unpublished,final]
      \step[fieldset=type,          fieldvalue=submittedto]
    } %»
  \map %«
    {
      \step[typesource=private,     typetarget=unpublished,final]
      \step[fieldset=type,          fieldvalue=private]
    } %»
#+end_src



**** Event or Journal

#+begin_src latex3 :noweb-ref mac
  \newbibmacro*{event/journal} %«
    {
      \iffieldundef{eventtitle}
        {
          \iffieldundef{journaltitle}
            {}
            {
              \printfield{journaltitle}
            } %»
        }
        {
          \printtext{presented ~ at ~ the}\addspace
          \printfield{eventtitle}
          \newunit
          \printfield{venue}
          \newunit
          \usebibmacro{eventdate/date/mon.year}
        } %»
    } %»
#+end_src


**** type

#+begin_src latex3 :noweb-ref new-bibstring
  \clist_map_inline:Nn %«
    \l_jacow_unpublished_types
    {
      \NewBibliographyString{#1}
    } %»
#+end_src

#+begin_src latex3 :noweb-ref def-bibstring
  atevent     = unpublished,
  atconf      = unpublished,
  submitted   = submitted\addspace for\addspace publication,
  submittedto = to\addspace be\addspace published,
  thisevent   = this\addspace conference,
  thisconf    = this\addspace conference,
  private     = private\addspace communication,
#+end_src

#+begin_src latex3 :noweb-ref mac
  \newbibmacro*{type} %«
    {
      \iffieldundef{type}
        {
          \ifbibstring{\thefield{entrytype}}
            {\printtext{\bibstring{\thefield{entrytype}}}}
            {
              \iffieldundef{event}
                {
                  \iffieldundef{journal}
                    {
                      \printtext{unpublished}
                    }
                    {
                      \printtext{to ~ be ~ published}
                    } %»
                }
                {
                  \printtext{unpublished}
                } %»
            } %»
        }
        {
          \printfield{type}
        } %»
    } %»
#+end_src

**** Private communication date

#+begin_src latex3 :noweb-ref mac
  \newbibmacro*{private+date} %«
    {
      \iffieldequalstr{type}{private}
        {\printdate}
        {} %»
    } %»
#+end_src

