index.html

<div id="outline-container-orgc505106" class="outline-4">
<h4 id="orgc505106"><span class="section-number-4">2.8.2.</span> unpublished</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
The expected result will look like this:
</p>
<ul class="org-ul">
<li>[Author], “[Paper title]”, presented at the [Event], [venue], [date], paper [eid], unpublished.</li>
<li>[Author], “[Paper title]”, presented at the [Event], [venue], [date], paper [eid], this conference.</li>
<li>[Author], “[Paper title]”, <i>[Journal]</i>, to be published.</li>
<li>[Author], “[Paper title]”, submitted for publication.</li>
<li>[Author], “[Paper title]”, unpublished.</li>
<li>[Author], private communication, [date].</li>
</ul>



<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{unpublished} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\labelnamepunct</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{event/journal}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{eid}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{type}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{private+date}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  }  <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\clist_const:Nn</span> <span style="color: #005e8b;">\l_jacow_unpublished_types</span> {atevent,atconf,thisevent,thisconf,submitted,submittedto,private}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\map</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\step</span>[typesource=atevent,   typetarget=unpublished,final]
    <span style="color: #721045;">\step</span>[fieldset=type,        fieldvalue=atevent]
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
<span style="color: #721045;">\map</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\step</span>[typesource=atconf,    typetarget=unpublished,final]
    <span style="color: #721045;">\step</span>[fieldset=type,        fieldvalue=atevent]
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
<span style="color: #721045;">\map</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\step</span>[typesource=thisevent, typetarget=unpublished,final]
    <span style="color: #721045;">\step</span>[fieldset=type,        fieldvalue=thisevent]
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
<span style="color: #721045;">\map</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\step</span>[typesource=thisconf,  typetarget=unpublished,final]
    <span style="color: #721045;">\step</span>[fieldset=type,        fieldvalue=thisevent]
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
<span style="color: #721045;">\map</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\step</span>[typesource=submitted, typetarget=unpublished,final]
    <span style="color: #721045;">\step</span>[fieldset=type,        fieldvalue=submitted]
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
<span style="color: #721045;">\map</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\step</span>[typesource=submittedto, typetarget=unpublished,final]
    <span style="color: #721045;">\step</span>[fieldset=type,          fieldvalue=submittedto]
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
<span style="color: #721045;">\map</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\step</span>[typesource=private,     typetarget=unpublished,final]
    <span style="color: #721045;">\step</span>[fieldset=type,          fieldvalue=private]
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>
</div>



<ol class="org-ol">
<li><a id="org46d6c9f"></a>Event or Journal<br />
<div class="outline-text-5" id="text-2-8-2-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\newbibmacro</span>*{event/journal} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\iffieldundef</span>{eventtitle}
      {
        <span style="color: #721045;">\iffieldundef</span>{journaltitle}
          {}
          {
            <span style="color: #721045;">\printfield</span>{journaltitle}
          } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
      }
      {
        <span style="color: #721045;">\printtext</span>{presented ~ at ~ the}<span style="color: #721045;">\addspace</span>
        <span style="color: #721045;">\printfield</span>{eventtitle}
        <span style="color: #721045;">\newunit</span>
        <span style="color: #721045;">\printfield</span>{venue}
        <span style="color: #721045;">\newunit</span>
        <span style="color: #721045;">\usebibmacro</span>{eventdate/date/mon.year}
      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>
</div>
</li>


<li><a id="orge735c87"></a>type<br />
<div class="outline-text-5" id="text-2-8-2-2">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\clist_map_inline:Nn</span> <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  <span style="color: #005e8b;">\l_jacow_unpublished_types</span>
  {
    <span style="color: #721045;">\NewBibliographyString</span>{#1}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3">atevent     = unpublished,
atconf      = unpublished,
submitted   = submitted<span style="color: #721045;">\addspace</span> for<span style="color: #721045;">\addspace</span> publication,
submittedto = to<span style="color: #721045;">\addspace</span> be<span style="color: #721045;">\addspace</span> published,
thisevent   = this<span style="color: #721045;">\addspace</span> conference,
thisconf    = this<span style="color: #721045;">\addspace</span> conference,
private     = private<span style="color: #721045;">\addspace</span> communication,
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\newbibmacro</span>*{type} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\iffieldundef</span>{type}
      {
        <span style="color: #721045;">\ifbibstring</span>{<span style="color: #721045;">\thefield</span>{entrytype}}
          {<span style="color: #721045;">\printtext</span>{<span style="color: #721045;">\bibstring</span>{<span style="color: #721045;">\thefield</span>{entrytype}}}}
          {
            <span style="color: #721045;">\iffieldundef</span>{event}
              {
                <span style="color: #721045;">\iffieldundef</span>{journal}
                  {
                    <span style="color: #721045;">\printtext</span>{unpublished}
                  }
                  {
                    <span style="color: #721045;">\printtext</span>{to ~ be ~ published}
                  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
              }
              {
                <span style="color: #721045;">\printtext</span>{unpublished}
              } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
          } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
      }
      {
        <span style="color: #721045;">\printfield</span>{type}
      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>
</div>
</li>

<li><a id="orgae45425"></a>Private communication date<br />
<div class="outline-text-5" id="text-2-8-2-3">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\newbibmacro</span>*{private+date} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\iffieldequalstr</span>{type}{private}
      {<span style="color: #721045;">\printdate</span>}
      {} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
