bbx.org
*** article

Expected result will be like:
- [Author], “[Paper title]”, /[Journal]/, vol. [volume], no. [issue], p. [page], [date]. =doi:10.[xxx/yyy/zzz]=
- [Author], “[Paper title]”, /[Journal]/, vol. [volume], no. [issue], pp. [pages], [date]. =doi:10.[xxx/yyy/zzz]=


#+begin_src latex3

  \DeclareBibliographyDriver{article} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \newunit\newblock
        \usebibmacro{title}
        \newunit\newblock
        \printfield{journaltitle}
        \newunit\newblock
        \printfield{volume}
        \newunit
        \printfirst{issue,number}
        \newunit
        \printfield{pages}
        \newunit\newblock
        \printdate
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»

#+end_src

**** vol. [volume]
:PROPERTIES:
:header-args: :noweb-ref fld
:END:

#+begin_src latex3
  \DeclareFieldFormat[article,periodical]{volume}{\bibstring{volume}\nobreakspace#1}
#+end_src

**** no. [issue]
:PROPERTIES:
:header-args: :noweb-ref fld
:END:

#+begin_src latex3
  \DeclareFieldFormat[article,periodical]{issue}{\bibstring{number}\nobreakspace#1}
  \DeclareFieldFormat[article,periodical]{number}{\bibstring{number}\nobreakspace#1}
#+end_src

*** inbook

Expected result:
- [Author], “[Chapter title]”, in /[Book Title]/, [Editor] Ed. [Location]: [Publisher], [date], p. [page]. =doi:10.[xxx/yyy/zzz]=


#+begin_src latex3

  \DeclareBibliographyDriver{inbook} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \newunit\newblock
        \usebibmacro{title}
        \newunit
        \printfirst{maintitle,booktitle}
        \newunit\newblock
        \usebibmacro{byeditor}
        \setunit{\addperiod\addspace}\newblock
        \usebibmacro{publisher+location+date}
        \newunit\newblock
        \printfield{pages}
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»

#+end_src

**** [Editor] Ed.

#+begin_src latex3 :noweb-ref mac
  \renewbibmacro*{byeditor} %«
    {
      \ifnameundef{editor}
        {}
        {
          \printnames[byeditor]{editor}
          \addspace
          \usebibmacro{bytypestrg}{editor}{editor}
        } %»
    } %»
#+end_src

#+begin_src latex3 :noweb-ref def-bibstring
  byeditor = Ed\adddot,
#+end_src

*** book

Expected result:
- [Author], /[Book Title]/. [Location]: [Publisher], [date]. =doi:10.[xxx/yyy/zzz]=


#+begin_src latex3

  \DeclareBibliographyDriver{book} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \newunit\newblock
        \usebibmacro{title}
        \setunit{\addperiod\addspace}\newblock
        \usebibmacro{publisher+location+date}
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»

#+end_src

*** report

Expected result:
- [Author], “[Report title]”, [institute], [address], Rep. [number], [date]. =doi:10.[xxx/yyy/zzz]=

#+begin_src latex3

  \DeclareBibliographyDriver{report} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \newunit\newblock
        \usebibmacro{title}
        \newunit\newblock
        \printlist{institution}
        \newunit
        \printlist{location}
        \newunit\newblock
        \printfield{type}
        \setunit{\addspace}
        \printfield{number}
        \newunit\newblock
        \printdate
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»

#+end_src

**** Rep. [number]

#+begin_src latex3 :noweb-ref fld
  \DeclareFieldFormat[report]{number}{#1}
#+end_src


#+begin_src latex3 :noweb-ref def-bibstring
  techreport = Rep\adddot,
#+end_src

