index.html

<div id="outline-container-org534ec71" class="outline-4">
<h4 id="org534ec71"><span class="section-number-4">2.8.3.</span> article</h4>
<div class="outline-text-4" id="text-2-8-3">
<p>
Expected result will be like:
</p>
<ul class="org-ul">
<li>[Author], “[Paper title]”, <i>[Journal]</i>, vol. [volume], no. [issue], p. [page], [date]. <code>doi:10.[xxx/yyy/zzz]</code></li>
<li>[Author], “[Paper title]”, <i>[Journal]</i>, vol. [volume], no. [issue], pp. [pages], [date]. <code>doi:10.[xxx/yyy/zzz]</code></li>
</ul>


<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{article} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{journaltitle}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{volume}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printfirst</span>{issue,number}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printfield</span>{pages}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printdate</span>
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgfeee878"></a>vol. [volume]<br />
<div class="outline-text-5" id="text-2-8-3-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>[article,periodical]{volume}{<span style="color: #721045;">\bibstring</span>{volume}<span style="color: #721045;">\nobreakspace</span>#1}
</pre>
</div>
</div>
</li>

<li><a id="orgdc807bc"></a>no. [issue]<br />
<div class="outline-text-5" id="text-2-8-3-2">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>[article,periodical]{issue}{<span style="color: #721045;">\bibstring</span>{number}<span style="color: #721045;">\nobreakspace</span>#1}
<span style="color: #721045;">\DeclareFieldFormat</span>[article,periodical]{number}{<span style="color: #721045;">\bibstring</span>{number}<span style="color: #721045;">\nobreakspace</span>#1}
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1c42162" class="outline-4">
<h4 id="org1c42162"><span class="section-number-4">2.8.4.</span> inbook</h4>
<div class="outline-text-4" id="text-2-8-4">
<p>
Expected result:
</p>
<ul class="org-ul">
<li>[Author], “[Chapter title]”, in <i>[Book Title]</i>, [Editor] Ed. [Location]: [Publisher], [date], p. [page]. <code>doi:10.[xxx/yyy/zzz]</code></li>
</ul>


<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{inbook} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printfirst</span>{maintitle,booktitle}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{byeditor}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{publisher+location+date}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{pages}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orga35c5f0"></a>[Editor] Ed.<br />
<div class="outline-text-5" id="text-2-8-4-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\renewbibmacro</span>*{byeditor} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\ifnameundef</span>{editor}
      {}
      {
        <span style="color: #721045;">\printnames</span>[byeditor]{editor}
        <span style="color: #721045;">\addspace</span>
        <span style="color: #721045;">\usebibmacro</span>{bytypestrg}{editor}{editor}
      } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex3">byeditor = Ed<span style="color: #721045;">\adddot</span>,
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org39970f3" class="outline-4">
<h4 id="org39970f3"><span class="section-number-4">2.8.5.</span> book</h4>
<div class="outline-text-4" id="text-2-8-5">
<p>
Expected result:
</p>
<ul class="org-ul">
<li>[Author], <i>[Book Title]</i>. [Location]: [Publisher], [date]. <code>doi:10.[xxx/yyy/zzz]</code></li>
</ul>


<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{book} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{publisher+location+date}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgcebd94b" class="outline-4">
<h4 id="orgcebd94b"><span class="section-number-4">2.8.6.</span> report</h4>
<div class="outline-text-4" id="text-2-8-6">
<p>
Expected result:
</p>
<ul class="org-ul">
<li>[Author], “[Report title]”, [institute], [address], Rep. [number], [date]. <code>doi:10.[xxx/yyy/zzz]</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{report} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printlist</span>{institution}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printlist</span>{location}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{type}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addspace</span>}
      <span style="color: #721045;">\printfield</span>{number}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printdate</span>
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org1e981c8"></a>Rep. [number]<br />
<div class="outline-text-5" id="text-2-8-6-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>[report]{number}{#1}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-latex3">techreport = Rep<span style="color: #721045;">\adddot</span>,
</pre>
</div>
</div>
</li>
</ol>
</div>
