bbx.org
*** thesis

Expected result:
- [Author], “[Title of thesis]”, Ph.D. thesis, [Institute], [address], [date]. =doi:10.[xxx/yyy/zzz]=


#+begin_src latex3

  \DeclareBibliographyDriver{thesis} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \newunit\newblock
        \usebibmacro{title}
        \newunit
        \printfield{type}
        \newunit\newblock
        \printlist{institution}
        \newunit
        \printlist{location}
        \newunit\newblock
        \printfield{number}
        \newunit\newblock
        \printdate
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»

#+end_src

**** type

#+begin_src latex3 :noweb-ref def-bibstring
  phdthesis = Ph\adddot D\adddot\addspace thesis,
#+end_src

*** TODO manual

*In JACoW Style Manual, it is a semicolon between the page number and the url.*

Expected result:
- /[Title]/, [organisation], [address], [date], p. [page]. =[url]=


#+begin_src latex3

  \DeclareBibliographyDriver{manual} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{title}
        \newunit\newblock
        \printlist{organization}
        \newunit
        \printlist{location}
        \newunit\newblock
        \printdate
        \newunit\newblock
        \printfield{pages}
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»
  
#+end_src

*** patent

Expected result:
- [Author], “[Title]”, [authority], No. [number], [date].


#+begin_src latex3

  \DeclareBibliographyDriver{patent} %«
    {
      \usebibmacro{bibindex}
      \usebibmacro{begentry} %«
        \usebibmacro{author}
        \newunit\newblock
        \usebibmacro{title}
        \newunit\newblock
        \printlist{location}
        \newunit\newblock
        \printfield{number}
        \newunit\newblock
        \printdate
        \setunit{\addperiod\addspace}\newblock
        \printfirst{doi,eprint,url} %»
      \usebibmacro{finentry}
    } %»

#+end_src

**** No. [number]

#+begin_src latex3 :noweb-ref fld
  \DeclareFieldFormat[patent]{number}{No.\nobreakspace#1}
#+end_src

** Fields
:PROPERTIES:
:header-args: :noweb-ref fld
:END:

*** /et al./

The Latin expression of “and others” needs to be in italic:
#+begin_src latex3 :noweb-ref def-bibstring
  andothers = \mkbibemph{et\addabbrvspace al\adddot},
#+end_src

*** [title]

All titles will be typeset with upright font wrapped in double quotation marks:
#+begin_src latex3
  \DeclareFieldFormat{title}{\mkbibquote{#1}}
#+end_src
except the =book/manual= title, which is in italic:
#+begin_src latex3
  \DeclareFieldFormat[book,manual]{title}{\mkbibemph{#1}}
#+end_src
and the =online= title, which does nothing:
#+begin_src latex3
  \DeclareFieldFormat[online]{title}{#1}
#+end_src

*** [maintitle]/[booktitle]

#+begin_src latex3
  \DeclareFieldFormat{maintitle}{\bibstring{in}\addspace\mkbibemph{#1}}
  \DeclareFieldFormat{booktitle}{\bibstring{in}\addspace\mkbibemph{#1}}
#+end_src


*** paper [eid]

#+begin_src latex3
  \DeclareFieldFormat{eid}{paper\addspace#1}
#+end_src

*** [doi]

#+begin_src latex3 :noweb-ref fld
  \DeclareFieldFormat{doi}{\doi{#1}}
#+end_src

*** [url]

#+begin_src latex3
  \DeclareFieldFormat{url}{\url{#1}}
#+end_src

** Macros
:PROPERTIES:
:header-args: :noweb-ref mac
:END:

Print an empty unit to flush the punctuation buffer at the end of the entry. The reason why =\finentry= is not used here is that =\finentry= will always print =\finentrypunct= which is less flexible.
#+begin_src latex3
  \renewbibmacro*{finentry} %«
    {
      \blx@begunit
      \blx@endunit
    }
#+end_src


* Samples
:PROPERTIES:
:header-args: :noweb tangle :tangle texmf/bibtex/bib/biblatex-jacow/jacow-sample.bib :mkdirp yes
:END:

** Conference

