index.html

<div id="outline-container-orgf980cdf" class="outline-4">
<h4 id="orgf980cdf"><span class="section-number-4">2.8.7.</span> thesis</h4>
<div class="outline-text-4" id="text-2-8-7">
<p>
Expected result:
</p>
<ul class="org-ul">
<li>[Author], “[Title of thesis]”, Ph.D. thesis, [Institute], [address], [date]. <code>doi:10.[xxx/yyy/zzz]</code></li>
</ul>


<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{thesis} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printfield</span>{type}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printlist</span>{institution}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printlist</span>{location}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{number}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printdate</span>
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org925c53a"></a>type<br />
<div class="outline-text-5" id="text-2-8-7-1">
<div class="org-src-container">
<pre class="src src-latex3">phdthesis = Ph<span style="color: #721045;">\adddot</span> D<span style="color: #721045;">\adddot</span><span style="color: #005e8b;">\addspace</span> thesis,
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgd60c175" class="outline-4">
<h4 id="orgd60c175"><span class="section-number-4">2.8.8.</span> <span class="todo TODO">TODO</span> manual</h4>
<div class="outline-text-4" id="text-2-8-8">
<p>
<b>In JACoW Style Manual, it is a semicolon between the page number and the url.</b>
</p>

<p>
Expected result:
</p>
<ul class="org-ul">
<li><i>[Title]</i>, [organisation], [address], [date], p. [page]. <code>[url]</code></li>
</ul>


<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{manual} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printlist</span>{organization}
      <span style="color: #721045;">\newunit</span>
      <span style="color: #721045;">\printlist</span>{location}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printdate</span>
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{pages}
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgce377f3" class="outline-4">
<h4 id="orgce377f3"><span class="section-number-4">2.8.9.</span> patent</h4>
<div class="outline-text-4" id="text-2-8-9">
<p>
Expected result:
</p>
<ul class="org-ul">
<li>[Author], “[Title]”, [authority], No. [number], [date].</li>
</ul>


<div class="org-src-container">
<pre class="src src-latex3">
<span style="color: #721045;">\DeclareBibliographyDriver</span>{patent} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\usebibmacro</span>{bibindex}
    <span style="color: #721045;">\usebibmacro</span>{begentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
      <span style="color: #721045;">\usebibmacro</span>{author}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\usebibmacro</span>{title}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printlist</span>{location}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printfield</span>{number}
      <span style="color: #721045;">\newunit</span><span style="color: #005e8b;">\newblock</span>
      <span style="color: #721045;">\printdate</span>
      <span style="color: #721045;">\setunit</span>{<span style="color: #721045;">\addperiod</span><span style="color: #005e8b;">\addspace</span>}<span style="color: #721045;">\newblock</span>
      <span style="color: #721045;">\printfirst</span>{doi,eprint,url} <span style="color: #7f0000; font-style: italic;">%&#187;</span>
    <span style="color: #721045;">\usebibmacro</span>{finentry}
  } <span style="color: #7f0000; font-style: italic;">%&#187;</span>

</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org15c738e"></a>No. [number]<br />
<div class="outline-text-5" id="text-2-8-9-1">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>[patent]{number}{No.<span style="color: #721045;">\nobreakspace</span>#1}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org0b8db8a" class="outline-3">
<h3 id="org0b8db8a"><span class="section-number-3">2.9.</span> Fields</h3>
<div class="outline-text-3" id="text-2-9">
</div>

<div id="outline-container-org31a9cab" class="outline-4">
<h4 id="org31a9cab"><span class="section-number-4">2.9.1.</span> <i>et al.</i></h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
The Latin expression of “and others” needs to be in italic:
</p>
<div class="org-src-container">
<pre class="src src-latex3">andothers = <span style="color: #721045;">\mkbibemph</span>{et<span style="color: #721045;">\addabbrvspace</span> al<span style="color: #721045;">\adddot</span>},
</pre>
</div>
</div>
</div>

<div id="outline-container-orged151b3" class="outline-4">
<h4 id="orged151b3"><span class="section-number-4">2.9.2.</span> [title]</h4>
<div class="outline-text-4" id="text-2-9-2">
<p>
All titles will be typeset with upright font wrapped in double quotation marks:
</p>
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>{title}{<span style="color: #721045;">\mkbibquote</span>{#1}}
</pre>
</div>
<p>
except the <code>book/manual</code> title, which is in italic:
</p>
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>[book,manual]{title}{<span style="color: #721045;">\mkbibemph</span>{#1}}
</pre>
</div>
<p>
and the <code>online</code> title, which does nothing:
</p>
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>[online]{title}{#1}
</pre>
</div>
</div>
</div>

<div id="outline-container-org461f033" class="outline-4">
<h4 id="org461f033"><span class="section-number-4">2.9.3.</span> [maintitle]/[booktitle]</h4>
<div class="outline-text-4" id="text-2-9-3">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>{maintitle}{<span style="color: #721045;">\bibstring</span>{in}<span style="color: #721045;">\addspace</span><span style="color: #005e8b;">\mkbibemph</span>{#1}}
<span style="color: #721045;">\DeclareFieldFormat</span>{booktitle}{<span style="color: #721045;">\bibstring</span>{in}<span style="color: #721045;">\addspace</span><span style="color: #005e8b;">\mkbibemph</span>{#1}}
</pre>
</div>
</div>
</div>


<div id="outline-container-org8c0fa95" class="outline-4">
<h4 id="org8c0fa95"><span class="section-number-4">2.9.4.</span> paper [eid]</h4>
<div class="outline-text-4" id="text-2-9-4">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>{eid}{paper<span style="color: #721045;">\addspace</span>#1}
</pre>
</div>
</div>
</div>

<div id="outline-container-org38f82c3" class="outline-4">
<h4 id="org38f82c3"><span class="section-number-4">2.9.5.</span> [doi]</h4>
<div class="outline-text-4" id="text-2-9-5">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>{doi}{<span style="color: #721045;">\doi</span>{#1}}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5339edb" class="outline-4">
<h4 id="org5339edb"><span class="section-number-4">2.9.6.</span> [url]</h4>
<div class="outline-text-4" id="text-2-9-6">
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\DeclareFieldFormat</span>{url}{<span style="color: #721045;">\url</span>{#1}}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc6fe52c" class="outline-3">
<h3 id="orgc6fe52c"><span class="section-number-3">2.10.</span> Macros</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Print an empty unit to flush the punctuation buffer at the end of the entry. The reason why <code>\finentry</code> is not used here is that <code>\finentry</code> will always print <code>\finentrypunct</code> which is less flexible.
</p>
<div class="org-src-container">
<pre class="src src-latex3"><span style="color: #721045;">\renewbibmacro</span>*{finentry} <span style="color: #7f0000; font-style: italic;">%&#171;</span>
  {
    <span style="color: #721045;">\blx@begunit</span>
    <span style="color: #721045;">\blx@endunit</span>
  }
</pre>
</div>
</div>
</div>
</div>
