bbx.org
*** Published in previous proceedings

Five or less authors:
#+begin_src bibtex
  @inproceedings{klaproth:ipac2022-mopopt018,
    author       = {S. Klaproth and H. De Gersem and A. Penirschke and T. Reichert and R. Singh},
    title        = {{Advancing to a GHz Transition Radiation Monitor for Longitudinal Charge Distribution Measurements}},
    booktitle    = {Proc. IPAC'22},
  % booktitle    = {Proc. 13th International Particle Accelerator Conference (IPAC'22)},
    pages        = {267--270},
    eid          = {MOPOPT018},
    language     = {english},
    keywords     = {vacuum, radiation, target, simulation, electron},
    venue        = {Bangkok, Thailand},
    series       = {International Particle Accelerator Conference},
    number       = {13},
    publisher    = {JACoW Publishing, Geneva, Switzerland},
    month        = {07},
    year         = {2022},
    issn         = {2673-5490},
    isbn         = {978-3-95450-227-1},
    doi          = {doi:10.18429/JACoW-IPAC2022-MOPOPT018},
    url          = {https://jacow.org/ipac2022/papers/mopopt018.pdf},
    abstract     = {{In the past, longitudinal beam profiles have been measured with e.g., Feschenko monitors*, Fast Faraday Cups (FFC)** and field monitors. Feschenko monitors usually examine an average shape over several pulses and FFCs are interceptive devices by design. In this work we want to present the progress in the development of a novel GHz diffraction radiation monitor which shall be able to measure the longitudinal charge distribution of single bunches within Hadron beam LINACS non-destructively. A proof-of-concept measurement has been performed at GSI. We aim for a resolution of 50 to 100ps at beam energies of β=0.05 to 0.74. electronic field simulations were performed using CST Particle Studio to determine an optimal RF-Window, which also suits as vacuum chamber and the beam energy and angular dependencies of the diffraction radiation for different materials were analyzed.}},
  }
#+end_src

#+begin_src bibtex
  @inproceedings{funakoshi:ipac2022-moplxgd1,
    author       = {Y. Funakoshi and T. Abe and K. Akai and Y. Arimoto and K. Egawa and S. Enomoto and H. Fukuma and K. Furukawa and N. Iida and H. Ikeda and T. Ishibashi and S.H. Iwabuchi and H. Kaji and T. Kamitani and T. Kawamoto and M. Kikuchi and T. Kobayashi and K. Kodama and H. Koiso and M. Masuzawa and K. Matsuoka and T. Mimashi and G. Mitsuka and F. Miyahara and T. Miyajima and T. Mori and A. Morita and S. Nakamura and T.T. Nakamura and K. Nakanishi and H.N. Nakayama and A. Natochii and M. Nishiwaki and S. Ogasawara and K. Ohmi and Y. Ohnishi and N. Ohuchi and K. Oide and T. Okada and T. Oki and M.A. Rehman and Y. Seimiya and K. Shibata and Y. Suetsugu and H. Sugimoto and H. Sugimura and M. Tawada and S. Terui and M. Tobiyama and R. Ueki and X. Wang and K. Watanabe and R.J. Yang and K. Yoshihara and S.I. Yoshimoto and T. Yoshimoto and D. Zhou and X. Zhou and Z.G. Zong},
  % author       = {Y. Funakoshi and T. Abe and K. Akai and Y. Arimoto and K. Egawa and S. Enomoto and others},
  % author       = {Y. Funakoshi and others},
    title        = {{The SuperKEKB Has Broken the World Record of the Luminosity}},
    booktitle    = {Proc. IPAC'22},
  % booktitle    = {Proc. 13th International Particle Accelerator Conference (IPAC'22)},
    pages        = {1--5},
    eid          = {MOPLXGD1},
    language     = {english},
    keywords     = {luminosity, injection, impedance, simulation, operation},
    venue        = {Bangkok, Thailand},
    series       = {International Particle Accelerator Conference},
    number       = {13},
    publisher    = {JACoW Publishing, Geneva, Switzerland},
    month        = {07},
    year         = {2022},
    issn         = {2673-5490},
    isbn         = {978-3-95450-227-1},
    doi          = {https://doi.org/10.18429/JACoW-IPAC2022-MOPLXGD1},
    url          = {https://jacow.org/ipac2022/papers/moplxgd1.pdf},
    abstract     = {{The SuperKEKB broke the world record of the luminosity in June 2020 in the Phase 3 operation. The luminosity has been increasing since then and the present highest luminosity is 4.65 x 10³⁴ cm⁻²s⁻¹ with β_{y}^{*} of 1 mm. The increase of the luminosity was brought with an application of crab waist, by increasing beam currents and by other improvements in the specific luminosity. In this paper, we describe what we have achieved and what we are struggling with. Finally, we mention a future plan briefly.}},
  }
#+end_src


