index.html


<div id="outline-container-orga40200a" class="outline-2">
<h2 id="orga40200a"><span class="section-number-2">3.</span> Samples</h2>
<div class="outline-text-2" id="text-3">
</div>

<div id="outline-container-org625fe00" class="outline-3">
<h3 id="org625fe00"><span class="section-number-3">3.1.</span> Conference</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org1c0f5ad" class="outline-4">
<h4 id="org1c0f5ad"><span class="section-number-4">3.1.1.</span> Published in previous proceedings</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Five or less authors:
</p>
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@inproceedings</span>{<span style="color: #0000b0;">klaproth:ipac2022-mopopt018</span>,
  <span style="color: #005e8b;">author</span>       = {S. Klaproth and H. De Gersem and A. Penirschke and T. Reichert and R. Singh},
  <span style="color: #005e8b;">title</span>        = {{Advancing to a GHz Transition Radiation Monitor for Longitudinal Charge Distribution Measurements}},
  <span style="color: #005e8b;">booktitle</span>    = {Proc. IPAC'22},
<span style="color: #7f0000; font-style: italic;">% booktitle    = {Proc. 13th International Particle Accelerator Conference (IPAC'22)},</span>
  <span style="color: #005e8b;">pages</span>        = {267--270},
  <span style="color: #005e8b;">eid</span>          = {MOPOPT018},
  <span style="color: #005e8b;">language</span>     = {english},
  <span style="color: #005e8b;">keywords</span>     = {vacuum, radiation, target, simulation, electron},
  <span style="color: #005e8b;">venue</span>        = {Bangkok, Thailand},
  <span style="color: #005e8b;">series</span>       = {International Particle Accelerator Conference},
  <span style="color: #005e8b;">number</span>       = {13},
  <span style="color: #005e8b;">publisher</span>    = {JACoW Publishing, Geneva, Switzerland},
  <span style="color: #005e8b;">month</span>        = {07},
  <span style="color: #005e8b;">year</span>         = {2022},
  <span style="color: #005e8b;">issn</span>         = {2673-5490},
  <span style="color: #005e8b;">isbn</span>         = {978-3-95450-227-1},
  <span style="color: #005e8b;">doi</span>          = {doi:<span style="color: #3548cf; text-decoration: underline;">10.18429/JACoW-IPAC2022-MOPOPT018</span>},
  <span style="color: #005e8b;">url</span>          = {<span style="color: #3548cf; text-decoration: underline;">https://jacow.org/ipac2022/papers/mopopt018.pdf</span>},
  <span style="color: #005e8b;">abstract</span>     = {{In the past, longitudinal beam profiles have been measured with e.g., Feschenko monitors*, Fast Faraday Cups (FFC)** and field monitors. Feschenko monitors usually examine an average shape over several pulses and FFCs are interceptive devices by design. In this work we want to present the progress in the development of a novel GHz diffraction radiation monitor which shall be able to measure the longitudinal charge distribution of single bunches within Hadron beam LINACS non-destructively. A proof-of-concept measurement has been performed at GSI. We aim for a resolution of 50 to 100ps at beam energies of &#946;=0.05 to 0.74. electronic field simulations were performed using CST Particle Studio to determine an optimal RF-Window, which also suits as vacuum chamber and the beam energy and angular dependencies of the diffraction radiation for different materials were analyzed.}},
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@inproceedings</span>{<span style="color: #0000b0;">funakoshi:ipac2022-moplxgd1</span>,
  <span style="color: #005e8b;">author</span>       = {Y. Funakoshi and T. Abe and K. Akai and Y. Arimoto and K. Egawa and S. Enomoto and H. Fukuma and K. Furukawa and N. Iida and H. Ikeda and T. Ishibashi and S.H. Iwabuchi and H. Kaji and T. Kamitani and T. Kawamoto and M. Kikuchi and T. Kobayashi and K. Kodama and H. Koiso and M. Masuzawa and K. Matsuoka and T. Mimashi and G. Mitsuka and F. Miyahara and T. Miyajima and T. Mori and A. Morita and S. Nakamura and T.T. Nakamura and K. Nakanishi and H.N. Nakayama and A. Natochii and M. Nishiwaki and S. Ogasawara and K. Ohmi and Y. Ohnishi and N. Ohuchi and K. Oide and T. Okada and T. Oki and M.A. Rehman and Y. Seimiya and K. Shibata and Y. Suetsugu and H. Sugimoto and H. Sugimura and M. Tawada and S. Terui and M. Tobiyama and R. Ueki and X. Wang and K. Watanabe and R.J. Yang and K. Yoshihara and S.I. Yoshimoto and T. Yoshimoto and D. Zhou and X. Zhou and Z.G. Zong},
<span style="color: #7f0000; font-style: italic;">% author       = {Y. Funakoshi and T. Abe and K. Akai and Y. Arimoto and K. Egawa and S. Enomoto and others},</span>
<span style="color: #7f0000; font-style: italic;">% author       = {Y. Funakoshi and others},</span>
  <span style="color: #005e8b;">title</span>        = {{The SuperKEKB Has Broken the World Record of the Luminosity}},
  <span style="color: #005e8b;">booktitle</span>    = {Proc. IPAC'22},
<span style="color: #7f0000; font-style: italic;">% booktitle    = {Proc. 13th International Particle Accelerator Conference (IPAC'22)},</span>
  <span style="color: #005e8b;">pages</span>        = {1--5},
  <span style="color: #005e8b;">eid</span>          = {MOPLXGD1},
  <span style="color: #005e8b;">language</span>     = {english},
  <span style="color: #005e8b;">keywords</span>     = {luminosity, injection, impedance, simulation, operation},
  <span style="color: #005e8b;">venue</span>        = {Bangkok, Thailand},
  <span style="color: #005e8b;">series</span>       = {International Particle Accelerator Conference},
  <span style="color: #005e8b;">number</span>       = {13},
  <span style="color: #005e8b;">publisher</span>    = {JACoW Publishing, Geneva, Switzerland},
  <span style="color: #005e8b;">month</span>        = {07},
  <span style="color: #005e8b;">year</span>         = {2022},
  <span style="color: #005e8b;">issn</span>         = {2673-5490},
  <span style="color: #005e8b;">isbn</span>         = {978-3-95450-227-1},
  <span style="color: #005e8b;">doi</span>          = {https://doi.org/<span style="color: #3548cf; text-decoration: underline;">10.18429/JACoW-IPAC2022-MOPLXGD1</span>},
  <span style="color: #005e8b;">url</span>          = {<span style="color: #3548cf; text-decoration: underline;">https://jacow.org/ipac2022/papers/moplxgd1.pdf</span>},
  <span style="color: #005e8b;">abstract</span>     = {{The SuperKEKB broke the world record of the luminosity in June 2020 in the Phase 3 operation. The luminosity has been increasing since then and the present highest luminosity is 4.65 x 10&#179;&#8308; cm&#8315;&#178;s&#8315;&#185; with &#946;_{y}^{*} of 1 mm. The increase of the luminosity was brought with an application of crab waist, by increasing beam currents and by other improvements in the specific luminosity. In this paper, we describe what we have achieved and what we are struggling with. Finally, we mention a future plan briefly.}},
}
</pre>
</div>
</div>
</div>
