bbx.org
*** Presented as a poster or slides only

#+begin_src bibtex
  @unpublished{lin:ipac2022-moiygd2,
    author       = {C. Lin},
    title        = {{Recent Progress of Compact LAser Plasma Accelerator at Peking University}},
    eventtitle   = {IPAC'22},
    eid          = {MOIYGD2},
    eventdate    = {2022-07-12/2022-07-17},
    language     = {english},
    type         = {atevent},
    venue        = {Bangkok, Thailand},
    abstract     = {{Usually large energy spread and shot-to-shot stability are the bottlenecks of laser accelerator in applications. Recently proton beam with energies less than 10 MeV, <1\% energy spread, several to tens of pC charge can be stably produced and transported in Compact LAser Plasma Accelerator (CLAPA) at Peking University. The CLAPA beam line is an object-image point analysing system, which ensures the transmission efficiency and energy selection accuracy for proton beams with initial large divergence angle and energy spread. A spread-out Bragg peak (SOBP) is produced with high precision beam control, which is essential for cancer therapy. Other primary application experiments based on laser-accelerated proton beam have also been carried out, such as FLASH irradiation, Laser Ion trace probe, proton radiograph, stress testing for tungsten, irradiation of semiconductor sensor to simulate the space irradiation environment and so on.}},
  }
#+end_src

or

#+begin_src bibtex
  @atconf{loisch:ipac2022-mooygd1,
    author       = {G. Loisch and J. Beinortaite and G.J. Boyle and J. Chappell and R.T.P. D’Arcy and S. Diederichs and B. Foster and J.M. Garland and P. Gonzalez-Caminal and C.A. Lindstrøm and J. Osterhoff and T. Parikh and S. Schreiber and S. Schröder and M. Thévenet and S. Wesch and M. Wing},
  % author       = {G. Loisch and J. Beinortaite and G.J. Boyle and J. Chappell and R.T.P. D’Arcy and S. Diederichs and others},
  % author       = {G. Loisch and others},
    title        = {{Experiments Towards High-Repetition Rate Plasma Wakefield Acceleration at FLASHForward}},
    eventtitle   = {IPAC'22},
    eid          = {MOOYGD1},
    language     = {english},
    venue        = {Bangkok, Thailand},
    month        = {07},
    year         = {2022},
    abstract     = {{Beam-driven plasma-wakefield acceleration (PWFA) is one of the most promising techniques to reduce significantly the size and cost of future lepton accelerators. Huge steps have been taken in the last decades towards achieving high acceleration gradients with simultaneous beam-quality preservation. However, in order to match both the luminosity demands of high-energy physics and the brilliance requirements of photon science, PWFA must be capable of accelerating thousands of bunches per second ’ orders of magnitude beyond the current state of the art. Historically, investigation of the rate limitation in plasmas was limited by the number of bunches available from the accelerator front-end. The FLASHForward facility, which is driven by the superconducting linac of the FLASH free-electron laser, is the first experiment capable of addressing this issue. We report here on first experimental results from the facility, aimed at determining the repetition rate limit of plasma accelerators arising from fundamental plasma processes* and finally advancing the repetition rate of PWFA from proof-of-principle experiments at a few bunches per second to a competitive plasma accelerator.}},
  }
#+end_src


