index.html


<div id="outline-container-orgf037d0b" class="outline-4">
<h4 id="orgf037d0b"><span class="section-number-4">3.1.2.</span> Presented as a poster or slides only</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@unpublished</span>{<span style="color: #0000b0;">lin:ipac2022-moiygd2</span>,
  <span style="color: #005e8b;">author</span>       = {C. Lin},
  <span style="color: #005e8b;">title</span>        = {{Recent Progress of Compact LAser Plasma Accelerator at Peking University}},
  <span style="color: #005e8b;">eventtitle</span>   = {IPAC'22},
  <span style="color: #005e8b;">eid</span>          = {MOIYGD2},
  <span style="color: #005e8b;">eventdate</span>    = {2022-07-12/2022-07-17},
  <span style="color: #005e8b;">language</span>     = {english},
  <span style="color: #005e8b;">type</span>         = {atevent},
  <span style="color: #005e8b;">venue</span>        = {Bangkok, Thailand},
  <span style="color: #005e8b;">abstract</span>     = {{Usually large energy spread and shot-to-shot stability are the bottlenecks of laser accelerator in applications. Recently proton beam with energies less than 10 MeV, &lt;1\% energy spread, several to tens of pC charge can be stably produced and transported in Compact LAser Plasma Accelerator (CLAPA) at Peking University. The CLAPA beam line is an object-image point analysing system, which ensures the transmission efficiency and energy selection accuracy for proton beams with initial large divergence angle and energy spread. A spread-out Bragg peak (SOBP) is produced with high precision beam control, which is essential for cancer therapy. Other primary application experiments based on laser-accelerated proton beam have also been carried out, such as FLASH irradiation, Laser Ion trace probe, proton radiograph, stress testing for tungsten, irradiation of semiconductor sensor to simulate the space irradiation environment and so on.}},
}
</pre>
</div>

<p>
or
</p>

<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@atconf</span>{<span style="color: #0000b0;">loisch:ipac2022-mooygd1</span>,
  <span style="color: #005e8b;">author</span>       = {G. Loisch and J. Beinortaite and G.J. Boyle and J. Chappell and R.T.P. D&#8217;Arcy and S. Diederichs and B. Foster and J.M. Garland and P. Gonzalez-Caminal and C.A. Lindstr&#248;m and J. Osterhoff and T. Parikh and S. Schreiber and S. Schr&#246;der and M. Th&#233;venet and S. Wesch and M. Wing},
<span style="color: #7f0000; font-style: italic;">% author       = {G. Loisch and J. Beinortaite and G.J. Boyle and J. Chappell and R.T.P. D&#8217;Arcy and S. Diederichs and others},</span>
<span style="color: #7f0000; font-style: italic;">% author       = {G. Loisch and others},</span>
  <span style="color: #005e8b;">title</span>        = {{Experiments Towards High-Repetition Rate Plasma Wakefield Acceleration at FLASHForward}},
  <span style="color: #005e8b;">eventtitle</span>   = {IPAC'22},
  <span style="color: #005e8b;">eid</span>          = {MOOYGD1},
  <span style="color: #005e8b;">language</span>     = {english},
  <span style="color: #005e8b;">venue</span>        = {Bangkok, Thailand},
  <span style="color: #005e8b;">month</span>        = {07},
  <span style="color: #005e8b;">year</span>         = {2022},
  <span style="color: #005e8b;">abstract</span>     = {{Beam-driven plasma-wakefield acceleration (PWFA) is one of the most promising techniques to reduce significantly the size and cost of future lepton accelerators. Huge steps have been taken in the last decades towards achieving high acceleration gradients with simultaneous beam-quality preservation. However, in order to match both the luminosity demands of high-energy physics and the brilliance requirements of photon science, PWFA must be capable of accelerating thousands of bunches per second &#8217; orders of magnitude beyond the current state of the art. Historically, investigation of the rate limitation in plasmas was limited by the number of bunches available from the accelerator front-end. The FLASHForward facility, which is driven by the superconducting linac of the FLASH free-electron laser, is the first experiment capable of addressing this issue. We report here on first experimental results from the facility, aimed at determining the repetition rate limit of plasma accelerators arising from fundamental plasma processes* and finally advancing the repetition rate of PWFA from proof-of-principle experiments at a few bunches per second to a competitive plasma accelerator.}},
}
</pre>
</div>
</div>
</div>
