bbx.org
*** Presented at this conference

#+begin_src bibtex
  @unpublished{cook:ipac2022-mopopt067,
    author       = {N.M. Cook and G. Andonian and A. Diaw and C.C. Hall and N.P. Norvell and M. Yadav},
    title        = {{Electron Beam Phase Space Reconstruction From a Gas Sheet Diagnostic}},
    eventtitle   = {IPAC'22},
    type         = {thisevent},
  % booktitle    = {Proc. 13th International Particle Accelerator Conference (IPAC'22)},
    pages        = {414--417},
    eid          = {MOPOPT067},
    language     = {english},
    keywords     = {simulation, electron, diagnostics, network, experiment},
    venue        = {Bangkok, Thailand},
    series       = {International Particle Accelerator Conference},
    number       = {13},
    publisher    = {JACoW Publishing, Geneva, Switzerland},
    month        = {07},
    year         = {2022},
    issn         = {2673-5490},
    isbn         = {978-3-95450-227-1},
    doi          = {10.18429/JACoW-IPAC2022-MOPOPT067},
    url          = {https://jacow.org/ipac2022/papers/mopopt067.pdf},
    abstract     = {{Next generation particle accelerators craft increasingly high brightness beams to achieve physics goals for applications ranging from colliders to free electron lasers to studies of nonperturbative QED. Such rigorous requirements on total charge and shape introduce diagnostic challenges for effectively measuring bunch parameters prior to or at interaction points. We report on the simulation and training of a non-destructive beam diagnostic capable of characterizing high intensity charged particle beams. The diagnostic consists of a tailored neutral gas curtain, electrostatic microscope, and high sensitivity camera. An incident electron beam ionizes the gas curtain, while the electrostatic microscope transports generated ions to an imaging screen. Simulations of the ionization and transport process are performed using the Warp code. Then, a neural network is trained to provide accurate estimates of the initial electron beam parameters. We present initial results for a range of beam and gas curtain parameters and comment on extensibility to other beam intensity regimes.}},
  }
#+end_src

#+begin_src bibtex
  @thisconf{edelen:ipac2022-moiysp1,
    author       = {A.L. Edelen},
    title        = {{Machine Learning as a Tool for Online, Surrogate Modelling of Beam Dynamics}},
    eventtitle   = {IPAC'22},
    eventdate    = {2022-07-12/2022-07-17},
    language     = {english},
    eid          = {MOIYSP1},
    venue        = {Bangkok, Thailand},
    note         = {presented at IPAC'22 in Bangkok, Thailand, unpublished},
    abstract     = {{The detailed design and optimization of accelerators has historically relied on high-fidelity simulations whose computational requirements limit their use as online tools. Recently, a growing community has begun reducing this computational burden by applying techniques from machine learning. For example, by learning from a sparse sampling of physics simulations one can develop fast-executing "surrogate models" that approximately predict accelerator performance for entirely new design parameters. Using these models can reduce compute times for multi-objective optimization studies by several orders of magnitude. In addition, surrogate models are now being applied in operational settings to enable non-invasive diagnostics and real-time optimization. This talk will cover developments in this field, applications to medium-energy electron photoinjectors, and how such surrogate models may improve our physics understanding of present and future accelerators.}},
  }
#+end_src



** Journal

*** Published article

#+begin_src bibtex
  @article{baker:nature-533-452,
    author       = {Baker, M.},
    title        = {1,500 scientists lift the lid on reproducibility},
    journal      = {Nature},
    volume       = 533,
    pages        = {452--454},
    year         = 2016,
    doi          = {10.1038/533452a},
  }
#+end_src

#+begin_src bibtex
  @article{PhysRevSTAB.17.112801,
    title = {Beam position monitor design for a third generation light source},
    author = {Chen, Zhichu and Leng, Yongbin and Ye, Kairong and Zhao, Guobi and Yuan, Renxian},
    journal = {Phys. Rev. ST Accel. Beams},
    volume = {17},
    issue = {11},
    pages = {112801},
    numpages = {8},
    year = {2014},
    month = {Nov},
    publisher = {American Physical Society},
    doi = {10.1103/PhysRevSTAB.17.112801},
    url = {https://link.aps.org/doi/10.1103/PhysRevSTAB.17.112801}
  }
#+end_src

#+begin_src bibtex
  @article{PhysRevSTAB.17.112803,
    title = {Wakefield measurement using principal component analysis on bunch-by-bunch information during transient state of injection in a storage ring},
    author = {Chen, Zhichu and Yang, Yong and Leng, Yongbin and Yuan, Renxian},
    journal = {Phys. Rev. ST Accel. Beams},
    volume = {17},
    number = {11},
    pages = {112803},
    numpages = {7},
    year = {2014},
    month = {Nov},
    publisher = {American Physical Society},
    doi = {10.1103/PhysRevSTAB.17.112803},
    url = {https://link.aps.org/doi/10.1103/PhysRevSTAB.17.112803}
  }
#+end_src

*** Article accepted by a periodical

#+begin_src bibtex
  @submittedto{chen:arxiv:1309.2353,
    title = {Experimental Study using {Touschek} Lifetime as Machine Status Flag in {SSRF}},
    author = {Zhichu Chen and Yongbin Leng and Renxian Yuan and Yingbing Yan and Luyang Yu},
    journal = {Chinese Physics C},
    doi = {https://doi.org/10.48550/arXiv.1309.2353},
  }
#+end_src

