index.html


<div id="outline-container-org6d4e0ba" class="outline-4">
<h4 id="org6d4e0ba"><span class="section-number-4">3.1.3.</span> Presented at this conference</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@unpublished</span>{<span style="color: #0000b0;">cook:ipac2022-mopopt067</span>,
  <span style="color: #005e8b;">author</span>       = {N.M. Cook and G. Andonian and A. Diaw and C.C. Hall and N.P. Norvell and M. Yadav},
  <span style="color: #005e8b;">title</span>        = {{Electron Beam Phase Space Reconstruction From a Gas Sheet Diagnostic}},
  <span style="color: #005e8b;">eventtitle</span>   = {IPAC'22},
  <span style="color: #005e8b;">type</span>         = {thisevent},
<span style="color: #7f0000; font-style: italic;">% booktitle    = {Proc. 13th International Particle Accelerator Conference (IPAC'22)},</span>
  <span style="color: #005e8b;">pages</span>        = {414--417},
  <span style="color: #005e8b;">eid</span>          = {MOPOPT067},
  <span style="color: #005e8b;">language</span>     = {english},
  <span style="color: #005e8b;">keywords</span>     = {simulation, electron, diagnostics, network, experiment},
  <span style="color: #005e8b;">venue</span>        = {Bangkok, Thailand},
  <span style="color: #005e8b;">series</span>       = {International Particle Accelerator Conference},
  <span style="color: #005e8b;">number</span>       = {13},
  <span style="color: #005e8b;">publisher</span>    = {JACoW Publishing, Geneva, Switzerland},
  <span style="color: #005e8b;">month</span>        = {07},
  <span style="color: #005e8b;">year</span>         = {2022},
  <span style="color: #005e8b;">issn</span>         = {2673-5490},
  <span style="color: #005e8b;">isbn</span>         = {978-3-95450-227-1},
  <span style="color: #005e8b;">doi</span>          = {<span style="color: #3548cf; text-decoration: underline;">10.18429/JACoW-IPAC2022-MOPOPT067</span>},
  <span style="color: #005e8b;">url</span>          = {<span style="color: #3548cf; text-decoration: underline;">https://jacow.org/ipac2022/papers/mopopt067.pdf</span>},
  <span style="color: #005e8b;">abstract</span>     = {{Next generation particle accelerators craft increasingly high brightness beams to achieve physics goals for applications ranging from colliders to free electron lasers to studies of nonperturbative QED. Such rigorous requirements on total charge and shape introduce diagnostic challenges for effectively measuring bunch parameters prior to or at interaction points. We report on the simulation and training of a non-destructive beam diagnostic capable of characterizing high intensity charged particle beams. The diagnostic consists of a tailored neutral gas curtain, electrostatic microscope, and high sensitivity camera. An incident electron beam ionizes the gas curtain, while the electrostatic microscope transports generated ions to an imaging screen. Simulations of the ionization and transport process are performed using the Warp code. Then, a neural network is trained to provide accurate estimates of the initial electron beam parameters. We present initial results for a range of beam and gas curtain parameters and comment on extensibility to other beam intensity regimes.}},
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@thisconf</span>{<span style="color: #0000b0;">edelen:ipac2022-moiysp1</span>,
  <span style="color: #005e8b;">author</span>       = {A.L. Edelen},
  <span style="color: #005e8b;">title</span>        = {{Machine Learning as a Tool for Online, Surrogate Modelling of Beam Dynamics}},
  <span style="color: #005e8b;">eventtitle</span>   = {IPAC'22},
  <span style="color: #005e8b;">eventdate</span>    = {2022-07-12/2022-07-17},
  <span style="color: #005e8b;">language</span>     = {english},
  <span style="color: #005e8b;">eid</span>          = {MOIYSP1},
  <span style="color: #005e8b;">venue</span>        = {Bangkok, Thailand},
  <span style="color: #005e8b;">note</span>         = {presented at IPAC'22 in Bangkok, Thailand, unpublished},
  <span style="color: #005e8b;">abstract</span>     = {{The detailed design and optimization of accelerators has historically relied on high-fidelity simulations whose computational requirements limit their use as online tools. Recently, a growing community has begun reducing this computational burden by applying techniques from machine learning. For example, by learning from a sparse sampling of physics simulations one can develop fast-executing "surrogate models" that approximately predict accelerator performance for entirely new design parameters. Using these models can reduce compute times for multi-objective optimization studies by several orders of magnitude. In addition, surrogate models are now being applied in operational settings to enable non-invasive diagnostics and real-time optimization. This talk will cover developments in this field, applications to medium-energy electron photoinjectors, and how such surrogate models may improve our physics understanding of present and future accelerators.}},
}
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org0ce31c8" class="outline-3">
<h3 id="org0ce31c8"><span class="section-number-3">3.2.</span> Journal</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgd7a6921" class="outline-4">
<h4 id="orgd7a6921"><span class="section-number-4">3.2.1.</span> Published article</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@article</span>{<span style="color: #0000b0;">baker:nature-533-452</span>,
  <span style="color: #005e8b;">author</span>       = {Baker, M.},
  <span style="color: #005e8b;">title</span>        = {1,500 scientists lift the lid on reproducibility},
  <span style="color: #005e8b;">journal</span>      = {Nature},
  <span style="color: #005e8b;">volume</span>       = 533,
  <span style="color: #005e8b;">pages</span>        = {452--454},
  <span style="color: #005e8b;">year</span>         = 2016,
  <span style="color: #005e8b;">doi</span>          = {<span style="color: #3548cf; text-decoration: underline;">10.1038/533452a</span>},
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@article</span>{<span style="color: #0000b0;">PhysRevSTAB.17.112801</span>,
  <span style="color: #005e8b;">title</span> = {Beam position monitor design for a third generation light source},
  <span style="color: #005e8b;">author</span> = {Chen, Zhichu and Leng, Yongbin and Ye, Kairong and Zhao, Guobi and Yuan, Renxian},
  <span style="color: #005e8b;">journal</span> = {Phys. Rev. ST Accel. Beams},
  <span style="color: #005e8b;">volume</span> = {17},
  <span style="color: #005e8b;">issue</span> = {11},
  <span style="color: #005e8b;">pages</span> = {112801},
  <span style="color: #005e8b;">numpages</span> = {8},
  <span style="color: #005e8b;">year</span> = {2014},
  <span style="color: #005e8b;">month</span> = {Nov},
  <span style="color: #005e8b;">publisher</span> = {American Physical Society},
  <span style="color: #005e8b;">doi</span> = {<span style="color: #3548cf; text-decoration: underline;">10.1103/PhysRevSTAB.17.112801</span>},
  <span style="color: #005e8b;">url</span> = {<span style="color: #3548cf; text-decoration: underline;">https://link.aps.org/doi/10.1103/PhysRevSTAB.17.112801</span>}
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@article</span>{<span style="color: #0000b0;">PhysRevSTAB.17.112803</span>,
  <span style="color: #005e8b;">title</span> = {Wakefield measurement using principal component analysis on bunch-by-bunch information during transient state of injection in a storage ring},
  <span style="color: #005e8b;">author</span> = {Chen, Zhichu and Yang, Yong and Leng, Yongbin and Yuan, Renxian},
  <span style="color: #005e8b;">journal</span> = {Phys. Rev. ST Accel. Beams},
  <span style="color: #005e8b;">volume</span> = {17},
  <span style="color: #005e8b;">number</span> = {11},
  <span style="color: #005e8b;">pages</span> = {112803},
  <span style="color: #005e8b;">numpages</span> = {7},
  <span style="color: #005e8b;">year</span> = {2014},
  <span style="color: #005e8b;">month</span> = {Nov},
  <span style="color: #005e8b;">publisher</span> = {American Physical Society},
  <span style="color: #005e8b;">doi</span> = {<span style="color: #3548cf; text-decoration: underline;">10.1103/PhysRevSTAB.17.112803</span>},
  <span style="color: #005e8b;">url</span> = {<span style="color: #3548cf; text-decoration: underline;">https://link.aps.org/doi/10.1103/PhysRevSTAB.17.112803</span>}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org694dd37" class="outline-4">
<h4 id="org694dd37"><span class="section-number-4">3.2.2.</span> Article accepted by a periodical</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@submittedto</span>{<span style="color: #0000b0;">chen:arxiv:1309.2353</span>,
  <span style="color: #005e8b;">title</span> = {Experimental Study using {Touschek} Lifetime as Machine Status Flag in {SSRF}},
  <span style="color: #005e8b;">author</span> = {Zhichu Chen and Yongbin Leng and Renxian Yuan and Yingbing Yan and Luyang Yu},
  <span style="color: #005e8b;">journal</span> = {Chinese Physics C},
  <span style="color: #005e8b;">doi</span> = {https://doi.org/<span style="color: #3548cf; text-decoration: underline;">10.48550/arXiv.1309.2353</span>},
}
</pre>
</div>
</div>
</div>
