bbx.org
*** Article submitted to a periodical

#+begin_src bibtex
  @submitted{author:fake-paper,
    title = {Fake paper wrote by the six {Author} brothers},
    author = {First Author and Second Author and Third Author and Fourth Author and Fifth Author and Sixth Author},
  }
#+end_src

*** Article not even submitted

#+begin_src bibtex
  @unpublished{author:fake-unfinished-paper,
    title = {Fake paper wrote by the seven {Author} brothers and still discussing},
    author = {First Author and Second Author and Third Author and Fourth Author and Fifth Author and Sixth Author and Seventh Author},
  }
#+end_src

** Book

*** Chapter in book

#+begin_src bibtex
  @inbook{forest:beam-dynamics:ch3,
    author = {Étienne Forest},
    title = {From the {Hamiltonian} to the map},
    booktitle = {Beam Dynamics},
    editor = {Nicolas Delerue and Alicia Hofler and Vasiliy Morozov and Marlene Turner and Philippe Piot and Toru Hara and Manuela Boscolo and Sam Posen},
    location = {London},
    publisher = {CRC Press},
    year = 1998,
    pages = {65-103},
    doi = {10.1201/9781315138176},
  }
#+end_src

*** A complete book

#+begin_src bibtex
  @book{wiedemann:particle-accelerator-physics,
    author = {Helmut Wiedemann},
    title = {Particle Accelerator Physics},
    publisher = {Springer Cham},
    date = {2015-07-28},
    doi = {https://doi.org/10.1007/978-3-319-18317-6},
  }
#+end_src

** Report

#+begin_src bibtex
  @techreport{herr:cern-2014-009.157,
    author = {Werner Herr},
    title = {Mathematical and Numerical Methods for Non-linear Beam Dynamics},
    institution = {CERN},
    location = {Geneva, Switzerland},
    number = {CERN-2014-009.157},
    year = 2016,
    doi = {10.5170/CERN-2014-009.157},
  }
#+end_src

** Thesis

*** PhD thesis

#+begin_src bibtex
  @phdthesis{fol:cern-thesis-2021-261,
    author = {Elena Fol},
    title = {Application of Machine Learning in Beam Optics Measurements and Corrections},
    school = {Goethe University},
    location = {Frankfurt},
    year = 2021,
    url = {https://cds.cern.ch/record/2799999?ln=en},
  }
#+end_src

** Manual

#+begin_src bibtex
  @manual{ieee-style,
    title = {{IEEE} Editorial Style Manual},
    organization = {IEEE Periodicals},
    location = {Piscataway, NJ, USA},
    date = {2014-10},
    pages = {34--52},
    url = {http://www.ieee.org/documents/style_manual.pdf},
  }
#+end_src

** Private communication

#+begin_src bibtex
  @private{fake-discussion,
    author = {Volker Reinhard Wolfgang Schaa},
    date = {2024-01-01}
  }
#+end_src

** Patent

#+begin_src bibtex
  @patent{fake-patent,
    author = {Zhichu Chen},
    title = {How to replace editors with Cylons (Cybernetic Lifeform Node)},
    location = {JACoW Patent Authority},
    number = {2020-0202},
    date = {2020-02-01},
  }
#+end_src

* Reference

[[pdfview:Refs/biblatex.pdf::1][BibLaTeX]]

