index.html

<div id="outline-container-orgbc76229" class="outline-4">
<h4 id="orgbc76229"><span class="section-number-4">3.2.3.</span> Article submitted to a periodical</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@submitted</span>{<span style="color: #0000b0;">author:fake-paper</span>,
  <span style="color: #005e8b;">title</span> = {Fake paper wrote by the six {Author} brothers},
  <span style="color: #005e8b;">author</span> = {First Author and Second Author and Third Author and Fourth Author and Fifth Author and Sixth Author},
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org39a90b2" class="outline-4">
<h4 id="org39a90b2"><span class="section-number-4">3.2.4.</span> Article not even submitted</h4>
<div class="outline-text-4" id="text-3-2-4">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@unpublished</span>{<span style="color: #0000b0;">author:fake-unfinished-paper</span>,
  <span style="color: #005e8b;">title</span> = {Fake paper wrote by the seven {Author} brothers and still discussing},
  <span style="color: #005e8b;">author</span> = {First Author and Second Author and Third Author and Fourth Author and Fifth Author and Sixth Author and Seventh Author},
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgabd953c" class="outline-3">
<h3 id="orgabd953c"><span class="section-number-3">3.3.</span> Book</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org30685ce" class="outline-4">
<h4 id="org30685ce"><span class="section-number-4">3.3.1.</span> Chapter in book</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@inbook</span>{<span style="color: #0000b0;">forest:beam-dynamics:ch3</span>,
  <span style="color: #005e8b;">author</span> = {&#201;tienne Forest},
  <span style="color: #005e8b;">title</span> = {From the {Hamiltonian} to the map},
  <span style="color: #005e8b;">booktitle</span> = {Beam Dynamics},
  <span style="color: #005e8b;">editor</span> = {Nicolas Delerue and Alicia Hofler and Vasiliy Morozov and Marlene Turner and Philippe Piot and Toru Hara and Manuela Boscolo and Sam Posen},
  <span style="color: #005e8b;">location</span> = {London},
  <span style="color: #005e8b;">publisher</span> = {CRC Press},
  <span style="color: #005e8b;">year</span> = 1998,
  <span style="color: #005e8b;">pages</span> = {65-103},
  <span style="color: #005e8b;">doi</span> = {<span style="color: #3548cf; text-decoration: underline;">10.1201/9781315138176</span>},
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org371cbca" class="outline-4">
<h4 id="org371cbca"><span class="section-number-4">3.3.2.</span> A complete book</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@book</span>{<span style="color: #0000b0;">wiedemann:particle-accelerator-physics</span>,
  <span style="color: #005e8b;">author</span> = {Helmut Wiedemann},
  <span style="color: #005e8b;">title</span> = {Particle Accelerator Physics},
  <span style="color: #005e8b;">publisher</span> = {Springer Cham},
  <span style="color: #005e8b;">date</span> = {2015-07-28},
  <span style="color: #005e8b;">doi</span> = {https://doi.org/<span style="color: #3548cf; text-decoration: underline;">10.1007/978-3-319-18317-6</span>},
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcf1bcb4" class="outline-3">
<h3 id="orgcf1bcb4"><span class="section-number-3">3.4.</span> Report</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@techreport</span>{<span style="color: #0000b0;">herr:cern-2014-009.157</span>,
  <span style="color: #005e8b;">author</span> = {Werner Herr},
  <span style="color: #005e8b;">title</span> = {Mathematical and Numerical Methods for Non-linear Beam Dynamics},
  <span style="color: #005e8b;">institution</span> = {CERN},
  <span style="color: #005e8b;">location</span> = {Geneva, Switzerland},
  <span style="color: #005e8b;">number</span> = {CERN-2014-009.157},
  <span style="color: #005e8b;">year</span> = 2016,
  <span style="color: #005e8b;">doi</span> = {<span style="color: #3548cf; text-decoration: underline;">10.5170/CERN-2014-009.157</span>},
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org30e54b2" class="outline-3">
<h3 id="org30e54b2"><span class="section-number-3">3.5.</span> Thesis</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-orga247b4a" class="outline-4">
<h4 id="orga247b4a"><span class="section-number-4">3.5.1.</span> PhD thesis</h4>
<div class="outline-text-4" id="text-3-5-1">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@phdthesis</span>{<span style="color: #0000b0;">fol:cern-thesis-2021-261</span>,
  <span style="color: #005e8b;">author</span> = {Elena Fol},
  <span style="color: #005e8b;">title</span> = {Application of Machine Learning in Beam Optics Measurements and Corrections},
  <span style="color: #005e8b;">school</span> = {Goethe University},
  <span style="color: #005e8b;">location</span> = {Frankfurt},
  <span style="color: #005e8b;">year</span> = 2021,
  <span style="color: #005e8b;">url</span> = {<span style="color: #3548cf; text-decoration: underline;">https://cds.cern.ch/record/2799999?ln=en</span>},
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgabeacf5" class="outline-3">
<h3 id="orgabeacf5"><span class="section-number-3">3.6.</span> Manual</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@manual</span>{<span style="color: #0000b0;">ieee-style</span>,
  <span style="color: #005e8b;">title</span> = {{IEEE} Editorial Style Manual},
  <span style="color: #005e8b;">organization</span> = {IEEE Periodicals},
  <span style="color: #005e8b;">location</span> = {Piscataway, NJ, USA},
  <span style="color: #005e8b;">date</span> = {2014-10},
  <span style="color: #005e8b;">pages</span> = {34--52},
  <span style="color: #005e8b;">url</span> = {<span style="color: #3548cf; text-decoration: underline;">http://www.ieee.org/documents/style_manual.pdf</span>},
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb34e0a3" class="outline-3">
<h3 id="orgb34e0a3"><span class="section-number-3">3.7.</span> Private communication</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@private</span>{<span style="color: #0000b0;">fake-discussion</span>,
  <span style="color: #005e8b;">author</span> = {Volker Reinhard Wolfgang Schaa},
  <span style="color: #005e8b;">date</span> = {2024-01-01}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7cd74a8" class="outline-3">
<h3 id="org7cd74a8"><span class="section-number-3">3.8.</span> Patent</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-bibtex"><span style="color: #721045;">@patent</span>{<span style="color: #0000b0;">fake-patent</span>,
  <span style="color: #005e8b;">author</span> = {Zhichu Chen},
  <span style="color: #005e8b;">title</span> = {How to replace editors with Cylons (Cybernetic Lifeform Node)},
  <span style="color: #005e8b;">location</span> = {JACoW Patent Authority},
  <span style="color: #005e8b;">number</span> = {2020-0202},
  <span style="color: #005e8b;">date</span> = {2020-02-01},
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0be0a80" class="outline-2">
<h2 id="org0be0a80"><span class="section-number-2">4.</span> Reference</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="Refs/biblatex.pdf::1">BibLaTeX</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhichu Chen</p>
<p class="date">Created: 2024-03-31 Sun 18:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>